
sources = [
    {
        "name": "上海市",
        "city": [
            {
                "name"  : "上海市",
                "adcode": "310100",
                "area"  : [
                    "崇明区",
                    "浦东新区",
                    "金山区",
                    "奉贤区",
                    "嘉定区",
                    "普陀区",
                    "宝山区",
                    "黄浦区",
                    "杨浦区",
                    "长宁区",
                    "松江区",
                    "虹口区",
                    "静安区",
                    "徐汇区",
                    "青浦区",
                    "闵行区"
                ]
            }
        ]
    },
    {
        "name": "云南省",
        "city": [
            {
                "name"  : "临沧市",
                "adcode": "530900",
                "area"  : [
                    "凤庆县",
                    "云县",
                    "永德县",
                    "镇康县",
                    "临翔区",
                    "耿马傣族佤族自治县",
                    "双江拉祜族佤族布朗族傣族自治县",
                    "沧源佤族自治县"
                ]
            },
            {
                "name"  : "丽江市",
                "adcode": "530700",
                "area"  : [
                    "宁蒗彝族自治县",
                    "永胜县",
                    "玉龙纳西族自治县",
                    "古城区",
                    "华坪县"
                ]
            },
            {
                "name"  : "保山市",
                "adcode": "530500",
                "area"  : [
                    "腾冲市",
                    "隆阳区",
                    "昌宁县",
                    "龙陵县",
                    "施甸县"
                ]
            },
            {
                "name"  : "大理白族自治州",
                "adcode": "532900",
                "area"  : [
                    "鹤庆县",
                    "云龙县",
                    "洱源县",
                    "剑川县",
                    "宾川县",
                    "大理市",
                    "弥渡县",
                    "祥云县",
                    "永平县",
                    "漾濞彝族自治县",
                    "巍山彝族回族自治县",
                    "南涧彝族自治县"
                ]
            },
            {
                "name"  : "德宏傣族景颇族自治州",
                "adcode": "533100",
                "area"  : [
                    "盈江县",
                    "梁河县",
                    "陇川县",
                    "芒市",
                    "瑞丽市"
                ]
            },
            {
                "name"  : "怒江傈僳族自治州",
                "adcode": "533300",
                "area"  : [
                    "贡山独龙族怒族自治县",
                    "兰坪白族普米族自治县",
                    "福贡县",
                    "泸水市"
                ]
            },
            {
                "name"  : "文山壮族苗族自治州",
                "adcode": "532600",
                "area"  : [
                    "丘北县",
                    "广南县",
                    "文山市",
                    "砚山县",
                    "西畴县",
                    "麻栗坡县",
                    "马关县",
                    "富宁县"
                ]
            },
            {
                "name"  : "昆明市",
                "adcode": "530100",
                "area"  : [
                    "寻甸回族彝族自治县",
                    "东川区",
                    "宜良县",
                    "五华区",
                    "西山区",
                    "石林彝族自治县",
                    "晋宁区",
                    "安宁市",
                    "富民县",
                    "禄劝彝族苗族自治县",
                    "嵩明县",
                    "盘龙区",
                    "官渡区",
                    "呈贡区"
                ]
            },
            {
                "name"  : "昭通市",
                "adcode": "530600",
                "area"  : [
                    "绥江县",
                    "永善县",
                    "大关县",
                    "威信县",
                    "水富市",
                    "巧家县",
                    "镇雄县",
                    "鲁甸县",
                    "昭阳区",
                    "彝良县",
                    "盐津县"
                ]
            },
            {
                "name"  : "普洱市",
                "adcode": "530800",
                "area"  : [
                    "景东彝族自治县",
                    "镇沅彝族哈尼族拉祜族自治县",
                    "宁洱哈尼族彝族自治县",
                    "景谷傣族彝族自治县",
                    "墨江哈尼族自治县",
                    "澜沧拉祜族自治县",
                    "思茅区",
                    "孟连傣族拉祜族佤族自治县",
                    "西盟佤族自治县",
                    "江城哈尼族彝族自治县"
                ]
            },
            {
                "name"  : "曲靖市",
                "adcode": "530300",
                "area"  : [
                    "会泽县",
                    "马龙区",
                    "罗平县",
                    "陆良县",
                    "师宗县",
                    "宣威市",
                    "富源县",
                    "麒麟区",
                    "沾益区"
                ]
            },
            {
                "name"  : "楚雄彝族自治州",
                "adcode": "532300",
                "area"  : [
                    "元谋县",
                    "大姚县",
                    "牟定县",
                    "姚安县",
                    "禄丰市",
                    "南华县",
                    "楚雄市",
                    "双柏县",
                    "武定县",
                    "永仁县"
                ]
            },
            {
                "name"  : "玉溪市",
                "adcode": "530400",
                "area"  : [
                    "易门县",
                    "华宁县",
                    "峨山彝族自治县",
                    "红塔区",
                    "江川区",
                    "新平彝族傣族自治县",
                    "通海县",
                    "元江哈尼族彝族傣族自治县",
                    "澄江市"
                ]
            },
            {
                "name"  : "红河哈尼族彝族自治州",
                "adcode": "532500",
                "area"  : [
                    "弥勒市",
                    "泸西县",
                    "石屏县",
                    "建水县",
                    "开远市",
                    "个旧市",
                    "元阳县",
                    "红河县",
                    "蒙自市",
                    "屏边苗族自治县",
                    "绿春县",
                    "金平苗族瑶族傣族自治县",
                    "河口瑶族自治县"
                ]
            },
            {
                "name"  : "西双版纳傣族自治州",
                "adcode": "532800",
                "area"  : [
                    "景洪市",
                    "勐腊县",
                    "勐海县"
                ]
            },
            {
                "name"  : "迪庆藏族自治州",
                "adcode": "533400",
                "area"  : [
                    "香格里拉市",
                    "德钦县",
                    "维西傈僳族自治县"
                ]
            }
        ]
    },
    {
        "name": "内蒙古自治区",
        "city": [
            {
                "name"  : "乌兰察布市",
                "adcode": "150900",
                "area"  : [
                    "四子王旗",
                    "化德县",
                    "察哈尔右翼后旗",
                    "商都县",
                    "察哈尔右翼中旗",
                    "兴和县",
                    "卓资县",
                    "丰镇市",
                    "集宁区",
                    "察哈尔右翼前旗",
                    "凉城县"
                ]
            },
            {
                "name"  : "乌海市",
                "adcode": "150300",
                "area"  : [
                    "乌达区",
                    "海南区",
                    "海勃湾区"
                ]
            },
            {
                "name"  : "兴安盟",
                "adcode": "152200",
                "area"  : [
                    "突泉县",
                    "科尔沁右翼中旗",
                    "阿尔山市",
                    "科尔沁右翼前旗",
                    "扎赉特旗",
                    "乌兰浩特市"
                ]
            },
            {
                "name"  : "包头市",
                "adcode": "150200",
                "area"  : [
                    "白云鄂博矿区",
                    "土默特右旗",
                    "达尔罕茂明安联合旗",
                    "固阳县",
                    "昆都仑区",
                    "石拐区",
                    "东河区",
                    "青山区",
                    "九原区"
                ]
            },
            {
                "name"  : "呼伦贝尔市",
                "adcode": "150700",
                "area"  : [
                    "额尔古纳市",
                    "根河市",
                    "牙克石市",
                    "陈巴尔虎旗",
                    "鄂温克族自治旗",
                    "阿荣旗",
                    "海拉尔区",
                    "扎兰屯市",
                    "扎赉诺尔区",
                    "新巴尔虎左旗",
                    "新巴尔虎右旗",
                    "满洲里市",
                    "鄂伦春自治旗",
                    "莫力达瓦达斡尔族自治旗"
                ]
            },
            {
                "name"  : "呼和浩特市",
                "adcode": "150100",
                "area"  : [
                    "和林格尔县",
                    "回民区",
                    "玉泉区",
                    "托克托县",
                    "土默特左旗",
                    "武川县",
                    "新城区",
                    "赛罕区",
                    "清水河县"
                ]
            },
            {
                "name"  : "巴彦淖尔市",
                "adcode": "150800",
                "area"  : [
                    "乌拉特中旗",
                    "临河区",
                    "五原县",
                    "磴口县",
                    "乌拉特前旗",
                    "乌拉特后旗",
                    "杭锦后旗"
                ]
            },
            {
                "name"  : "赤峰市",
                "adcode": "150400",
                "area"  : [
                    "阿鲁科尔沁旗",
                    "巴林右旗",
                    "林西县",
                    "巴林左旗",
                    "松山区",
                    "红山区",
                    "喀喇沁旗",
                    "敖汉旗",
                    "宁城县",
                    "元宝山区",
                    "克什克腾旗",
                    "翁牛特旗"
                ]
            },
            {
                "name"  : "通辽市",
                "adcode": "150500",
                "area"  : [
                    "霍林郭勒市",
                    "扎鲁特旗",
                    "科尔沁左翼中旗",
                    "开鲁县",
                    "库伦旗",
                    "科尔沁区",
                    "奈曼旗",
                    "科尔沁左翼后旗"
                ]
            },
            {
                "name"  : "鄂尔多斯市",
                "adcode": "150600",
                "area"  : [
                    "达拉特旗",
                    "杭锦旗",
                    "鄂托克旗",
                    "乌审旗",
                    "鄂托克前旗",
                    "康巴什区",
                    "伊金霍洛旗",
                    "东胜区",
                    "准格尔旗"
                ]
            },
            {
                "name"  : "锡林郭勒盟",
                "adcode": "152500",
                "area"  : [
                    "东乌珠穆沁旗",
                    "西乌珠穆沁旗",
                    "锡林浩特市",
                    "苏尼特左旗",
                    "阿巴嘎旗",
                    "苏尼特右旗",
                    "正镶白旗",
                    "二连浩特市",
                    "正蓝旗",
                    "镶黄旗",
                    "太仆寺旗",
                    "多伦县"
                ]
            },
            {
                "name"  : "阿拉善盟",
                "adcode": "152900",
                "area"  : [
                    "额济纳旗",
                    "阿拉善右旗",
                    "阿拉善左旗"
                ]
            }
        ]
    },
    {
        "name": "北京市",
        "city": [
            {
                "name"  : "北京市",
                "adcode": "110100",
                "area"  : [
                    "怀柔区",
                    "延庆区",
                    "顺义区",
                    "门头沟区",
                    "平谷区",
                    "朝阳区",
                    "东城区",
                    "大兴区",
                    "通州区",
                    "密云区",
                    "房山区",
                    "西城区",
                    "丰台区",
                    "石景山区",
                    "海淀区",
                    "昌平区"
                ]
            }
        ]
    },
    {
        "name": "吉林省",
        "city": [
            {
                "name"  : "吉林市",
                "adcode": "220200",
                "area"  : [
                    "丰满区",
                    "桦甸市",
                    "舒兰市",
                    "蛟河市",
                    "龙潭区",
                    "永吉县",
                    "磐石市",
                    "昌邑区",
                    "船营区"
                ]
            },
            {
                "name"  : "四平市",
                "adcode": "220300",
                "area"  : [
                    "铁东区",
                    "双辽市",
                    "伊通满族自治县",
                    "梨树县",
                    "铁西区"
                ]
            },
            {
                "name"  : "延边朝鲜族自治州",
                "adcode": "222400",
                "area"  : [
                    "图们市",
                    "珲春市",
                    "和龙市",
                    "汪清县",
                    "安图县",
                    "延吉市",
                    "敦化市",
                    "龙井市"
                ]
            },
            {
                "name"  : "松原市",
                "adcode": "220700",
                "area"  : [
                    "扶余市",
                    "宁江区",
                    "前郭尔罗斯蒙古族自治县",
                    "乾安县",
                    "长岭县"
                ]
            },
            {
                "name"  : "白城市",
                "adcode": "220800",
                "area"  : [
                    "大安市",
                    "洮南市",
                    "通榆县",
                    "洮北区",
                    "镇赉县"
                ]
            },
            {
                "name"  : "白山市",
                "adcode": "220600",
                "area"  : [
                    "靖宇县",
                    "江源区",
                    "长白朝鲜族自治县",
                    "抚松县",
                    "临江市",
                    "浑江区"
                ]
            },
            {
                "name"  : "辽源市",
                "adcode": "220400",
                "area"  : [
                    "西安区",
                    "东丰县",
                    "东辽县",
                    "龙山区"
                ]
            },
            {
                "name"  : "通化市",
                "adcode": "220500",
                "area"  : [
                    "通化县",
                    "东昌区",
                    "二道江区",
                    "柳河县",
                    "辉南县",
                    "梅河口市",
                    "集安市"
                ]
            },
            {
                "name"  : "长春市",
                "adcode": "220100",
                "area"  : [
                    "德惠市",
                    "榆树市",
                    "双阳区",
                    "农安县",
                    "宽城区",
                    "九台区",
                    "公主岭市",
                    "朝阳区",
                    "绿园区",
                    "南关区",
                    "二道区"
                ]
            }
        ]
    },
    {
        "name": "四川省",
        "city": [
            {
                "name"  : "乐山市",
                "adcode": "511100",
                "area"  : [
                    "夹江县",
                    "沙湾区",
                    "犍为县",
                    "金口河区",
                    "峨边彝族自治县",
                    "井研县",
                    "五通桥区",
                    "沐川县",
                    "马边彝族自治县",
                    "市中区",
                    "峨眉山市"
                ]
            },
            {
                "name"  : "内江市",
                "adcode": "511000",
                "area"  : [
                    "资中县",
                    "威远县",
                    "东兴区",
                    "隆昌市",
                    "市中区"
                ]
            },
            {
                "name"  : "凉山彝族自治州",
                "adcode": "513400",
                "area"  : [
                    "普格县",
                    "雷波县",
                    "会理市",
                    "美姑县",
                    "冕宁县",
                    "会东县",
                    "木里藏族自治县",
                    "甘洛县",
                    "金阳县",
                    "越西县",
                    "布拖县",
                    "喜德县",
                    "盐源县",
                    "德昌县",
                    "宁南县",
                    "西昌市",
                    "昭觉县"
                ]
            },
            {
                "name"  : "南充市",
                "adcode": "511300",
                "area"  : [
                    "嘉陵区",
                    "南部县",
                    "蓬安县",
                    "西充县",
                    "营山县",
                    "仪陇县",
                    "顺庆区",
                    "高坪区",
                    "阆中市"
                ]
            },
            {
                "name"  : "宜宾市",
                "adcode": "511500",
                "area"  : [
                    "珙县",
                    "江安县",
                    "高县",
                    "长宁县",
                    "兴文县",
                    "南溪区",
                    "筠连县",
                    "翠屏区",
                    "屏山县",
                    "叙州区"
                ]
            },
            {
                "name"  : "巴中市",
                "adcode": "511900",
                "area"  : [
                    "通江县",
                    "平昌县",
                    "南江县",
                    "巴州区",
                    "恩阳区"
                ]
            },
            {
                "name"  : "广元市",
                "adcode": "510800",
                "area"  : [
                    "朝天区",
                    "苍溪县",
                    "昭化区",
                    "剑阁县",
                    "旺苍县",
                    "青川县",
                    "利州区"
                ]
            },
            {
                "name"  : "广安市",
                "adcode": "511600",
                "area"  : [
                    "邻水县",
                    "武胜县",
                    "广安区",
                    "前锋区",
                    "华蓥市",
                    "岳池县"
                ]
            },
            {
                "name"  : "德阳市",
                "adcode": "510600",
                "area"  : [
                    "中江县",
                    "广汉市",
                    "旌阳区",
                    "什邡市",
                    "罗江区",
                    "绵竹市"
                ]
            },
            {
                "name"  : "成都市",
                "adcode": "510100",
                "area"  : [
                    "崇州市",
                    "都江堰市",
                    "青白江区",
                    "大邑县",
                    "简阳市",
                    "彭州市",
                    "蒲江县",
                    "金堂县",
                    "新津区",
                    "邛崃市",
                    "温江区",
                    "武侯区",
                    "双流区",
                    "新都区",
                    "龙泉驿区",
                    "成华区",
                    "锦江区",
                    "青羊区",
                    "金牛区",
                    "郫都区"
                ]
            },
            {
                "name"  : "攀枝花市",
                "adcode": "510400",
                "area"  : [
                    "米易县",
                    "西区",
                    "盐边县",
                    "东区",
                    "仁和区"
                ]
            },
            {
                "name"  : "泸州市",
                "adcode": "510500",
                "area"  : [
                    "纳溪区",
                    "古蔺县",
                    "泸县",
                    "龙马潭区",
                    "叙永县",
                    "江阳区",
                    "合江县"
                ]
            },
            {
                "name"  : "甘孜藏族自治州",
                "adcode": "513300",
                "area"  : [
                    "德格县",
                    "甘孜县",
                    "石渠县",
                    "道孚县",
                    "巴塘县",
                    "理塘县",
                    "新龙县",
                    "炉霍县",
                    "白玉县",
                    "雅江县",
                    "康定市",
                    "稻城县",
                    "乡城县",
                    "九龙县",
                    "得荣县",
                    "丹巴县",
                    "色达县",
                    "泸定县"
                ]
            },
            {
                "name"  : "眉山市",
                "adcode": "511400",
                "area"  : [
                    "洪雅县",
                    "丹棱县",
                    "仁寿县",
                    "彭山区",
                    "青神县",
                    "东坡区"
                ]
            },
            {
                "name"  : "绵阳市",
                "adcode": "510700",
                "area"  : [
                    "江油市",
                    "梓潼县",
                    "游仙区",
                    "三台县",
                    "盐亭县",
                    "安州区",
                    "平武县",
                    "涪城区",
                    "北川羌族自治县"
                ]
            },
            {
                "name"  : "自贡市",
                "adcode": "510300",
                "area"  : [
                    "沿滩区",
                    "富顺县",
                    "贡井区",
                    "自流井区",
                    "大安区",
                    "荣县"
                ]
            },
            {
                "name"  : "资阳市",
                "adcode": "512000",
                "area"  : [
                    "乐至县",
                    "雁江区",
                    "安岳县"
                ]
            },
            {
                "name"  : "达州市",
                "adcode": "511700",
                "area"  : [
                    "大竹县",
                    "宣汉县",
                    "渠县",
                    "开江县",
                    "万源市",
                    "通川区",
                    "达川区"
                ]
            },
            {
                "name"  : "遂宁市",
                "adcode": "510900",
                "area"  : [
                    "船山区",
                    "大英县",
                    "蓬溪县",
                    "安居区",
                    "射洪市"
                ]
            },
            {
                "name"  : "阿坝藏族羌族自治州",
                "adcode": "513200",
                "area"  : [
                    "马尔康市",
                    "九寨沟县",
                    "黑水县",
                    "若尔盖县",
                    "红原县",
                    "阿坝县",
                    "金川县",
                    "理县",
                    "汶川县",
                    "松潘县",
                    "茂县",
                    "壤塘县",
                    "小金县"
                ]
            },
            {
                "name"  : "雅安市",
                "adcode": "511800",
                "area"  : [
                    "雨城区",
                    "芦山县",
                    "荥经县",
                    "汉源县",
                    "天全县",
                    "宝兴县",
                    "石棉县",
                    "名山区"
                ]
            }
        ]
    },
    {
        "name": "天津市",
        "city": [
            {
                "name"  : "天津市",
                "adcode": "120100",
                "area"  : [
                    "宝坻区",
                    "和平区",
                    "河北区",
                    "蓟州区",
                    "滨海新区",
                    "静海区",
                    "武清区",
                    "南开区",
                    "宁河区",
                    "红桥区",
                    "津南区",
                    "西青区",
                    "河西区",
                    "东丽区",
                    "北辰区",
                    "河东区"
                ]
            }
        ]
    },
    {
        "name": "宁夏回族自治区",
        "city": [
            {
                "name"  : "中卫市",
                "adcode": "640500",
                "area"  : [
                    "海原县",
                    "沙坡头区",
                    "中宁县"
                ]
            },
            {
                "name"  : "吴忠市",
                "adcode": "640300",
                "area"  : [
                    "青铜峡市",
                    "同心县",
                    "盐池县",
                    "利通区",
                    "红寺堡区"
                ]
            },
            {
                "name"  : "固原市",
                "adcode": "640400",
                "area"  : [
                    "隆德县",
                    "彭阳县",
                    "泾源县",
                    "西吉县",
                    "原州区"
                ]
            },
            {
                "name"  : "石嘴山市",
                "adcode": "640200",
                "area"  : [
                    "惠农区",
                    "大武口区",
                    "平罗县"
                ]
            },
            {
                "name"  : "银川市",
                "adcode": "640100",
                "area"  : [
                    "永宁县",
                    "西夏区",
                    "兴庆区",
                    "灵武市",
                    "金凤区",
                    "贺兰县"
                ]
            }
        ]
    },
    {
        "name": "安徽省",
        "city": [
            {
                "name"  : "亳州市",
                "adcode": "341600",
                "area"  : [
                    "谯城区",
                    "利辛县",
                    "蒙城县",
                    "涡阳县"
                ]
            },
            {
                "name"  : "六安市",
                "adcode": "341500",
                "area"  : [
                    "霍山县",
                    "裕安区",
                    "金安区",
                    "金寨县",
                    "霍邱县",
                    "叶集区",
                    "舒城县"
                ]
            },
            {
                "name"  : "合肥市",
                "adcode": "340100",
                "area"  : [
                    "瑶海区",
                    "巢湖市",
                    "肥东县",
                    "庐江县",
                    "长丰县",
                    "蜀山区",
                    "肥西县",
                    "包河区",
                    "庐阳区"
                ]
            },
            {
                "name"  : "安庆市",
                "adcode": "340800",
                "area"  : [
                    "岳西县",
                    "潜山市",
                    "宜秀区",
                    "迎江区",
                    "太湖县",
                    "望江县",
                    "桐城市",
                    "宿松县",
                    "大观区",
                    "怀宁县"
                ]
            },
            {
                "name"  : "宣城市",
                "adcode": "341800",
                "area"  : [
                    "广德市",
                    "旌德县",
                    "宣州区",
                    "郎溪县",
                    "泾县",
                    "宁国市",
                    "绩溪县"
                ]
            },
            {
                "name"  : "宿州市",
                "adcode": "341300",
                "area"  : [
                    "埇桥区",
                    "泗县",
                    "萧县",
                    "灵璧县",
                    "砀山县"
                ]
            },
            {
                "name"  : "池州市",
                "adcode": "341700",
                "area"  : [
                    "贵池区",
                    "石台县",
                    "青阳县",
                    "东至县"
                ]
            },
            {
                "name"  : "淮北市",
                "adcode": "340600",
                "area"  : [
                    "杜集区",
                    "烈山区",
                    "相山区",
                    "濉溪县"
                ]
            },
            {
                "name"  : "淮南市",
                "adcode": "340400",
                "area"  : [
                    "凤台县",
                    "潘集区",
                    "八公山区",
                    "大通区",
                    "田家庵区",
                    "谢家集区",
                    "寿县"
                ]
            },
            {
                "name"  : "滁州市",
                "adcode": "341100",
                "area"  : [
                    "明光市",
                    "天长市",
                    "凤阳县",
                    "来安县",
                    "定远县",
                    "琅琊区",
                    "南谯区",
                    "全椒县"
                ]
            },
            {
                "name"  : "芜湖市",
                "adcode": "340200",
                "area"  : [
                    "繁昌区",
                    "无为市",
                    "镜湖区",
                    "鸠江区",
                    "弋江区",
                    "湾沚区",
                    "南陵县"
                ]
            },
            {
                "name"  : "蚌埠市",
                "adcode": "340300",
                "area"  : [
                    "淮上区",
                    "五河县",
                    "禹会区",
                    "怀远县",
                    "龙子湖区",
                    "蚌山区",
                    "固镇县"
                ]
            },
            {
                "name"  : "铜陵市",
                "adcode": "340700",
                "area"  : [
                    "郊区",
                    "铜官区",
                    "义安区",
                    "枞阳县"
                ]
            },
            {
                "name"  : "阜阳市",
                "adcode": "341200",
                "area"  : [
                    "临泉县",
                    "颍泉区",
                    "颍州区",
                    "太和县",
                    "颍东区",
                    "阜南县",
                    "颍上县",
                    "界首市"
                ]
            },
            {
                "name"  : "马鞍山市",
                "adcode": "340500",
                "area"  : [
                    "博望区",
                    "雨山区",
                    "花山区",
                    "和县",
                    "含山县",
                    "当涂县"
                ]
            },
            {
                "name"  : "黄山市",
                "adcode": "341000",
                "area"  : [
                    "黄山区",
                    "黟县",
                    "祁门县",
                    "徽州区",
                    "屯溪区",
                    "歙县",
                    "休宁县"
                ]
            }
        ]
    },
    {
        "name": "山东省",
        "city": [
            {
                "name"  : "东营市",
                "adcode": "370500",
                "area"  : [
                    "利津县",
                    "广饶县",
                    "东营区",
                    "河口区",
                    "垦利区"
                ]
            },
            {
                "name"  : "临沂市",
                "adcode": "371300",
                "area"  : [
                    "蒙阴县",
                    "平邑县",
                    "兰山区",
                    "郯城县",
                    "莒南县",
                    "沂南县",
                    "罗庄区",
                    "费县",
                    "兰陵县",
                    "河东区",
                    "临沭县",
                    "沂水县"
                ]
            },
            {
                "name"  : "威海市",
                "adcode": "371000",
                "area"  : [
                    "环翠区",
                    "荣成市",
                    "文登区",
                    "乳山市"
                ]
            },
            {
                "name"  : "德州市",
                "adcode": "371400",
                "area"  : [
                    "乐陵市",
                    "宁津县",
                    "德城区",
                    "武城县",
                    "庆云县",
                    "齐河县",
                    "陵城区",
                    "平原县",
                    "夏津县",
                    "临邑县",
                    "禹城市"
                ]
            },
            {
                "name"  : "日照市",
                "adcode": "371100",
                "area"  : [
                    "东港区",
                    "岚山区",
                    "莒县",
                    "五莲县"
                ]
            },
            {
                "name"  : "枣庄市",
                "adcode": "370400",
                "area"  : [
                    "峄城区",
                    "山亭区",
                    "滕州市",
                    "台儿庄区",
                    "市中区",
                    "薛城区"
                ]
            },
            {
                "name"  : "泰安市",
                "adcode": "370900",
                "area"  : [
                    "新泰市",
                    "东平县",
                    "泰山区",
                    "岱岳区",
                    "肥城市",
                    "宁阳县"
                ]
            },
            {
                "name"  : "济南市",
                "adcode": "370100",
                "area"  : [
                    "章丘区",
                    "济阳区",
                    "平阴县",
                    "商河县",
                    "长清区",
                    "钢城区",
                    "莱芜区",
                    "天桥区",
                    "历城区",
                    "历下区",
                    "槐荫区",
                    "市中区"
                ]
            },
            {
                "name"  : "济宁市",
                "adcode": "370800",
                "area"  : [
                    "泗水县",
                    "汶上县",
                    "曲阜市",
                    "邹城市",
                    "嘉祥县",
                    "梁山县",
                    "金乡县",
                    "兖州区",
                    "鱼台县",
                    "微山县",
                    "任城区"
                ]
            },
            {
                "name"  : "淄博市",
                "adcode": "370300",
                "area"  : [
                    "高青县",
                    "桓台县",
                    "临淄区",
                    "博山区",
                    "张店区",
                    "沂源县",
                    "周村区",
                    "淄川区"
                ]
            },
            {
                "name"  : "滨州市",
                "adcode": "371600",
                "area"  : [
                    "滨城区",
                    "沾化区",
                    "博兴县",
                    "邹平市",
                    "无棣县",
                    "阳信县",
                    "惠民县"
                ]
            },
            {
                "name"  : "潍坊市",
                "adcode": "370700",
                "area"  : [
                    "潍城区",
                    "临朐县",
                    "奎文区",
                    "寿光市",
                    "寒亭区",
                    "青州市",
                    "高密市",
                    "昌邑市",
                    "坊子区",
                    "昌乐县",
                    "安丘市",
                    "诸城市"
                ]
            },
            {
                "name"  : "烟台市",
                "adcode": "370600",
                "area"  : [
                    "芝罘区",
                    "蓬莱区",
                    "莱州市",
                    "海阳市",
                    "龙口市",
                    "莱阳市",
                    "招远市",
                    "莱山区",
                    "福山区",
                    "栖霞市",
                    "牟平区"
                ]
            },
            {
                "name"  : "聊城市",
                "adcode": "371500",
                "area"  : [
                    "冠县",
                    "莘县",
                    "东昌府区",
                    "茌平区",
                    "东阿县",
                    "阳谷县",
                    "高唐县",
                    "临清市"
                ]
            },
            {
                "name"  : "菏泽市",
                "adcode": "371700",
                "area"  : [
                    "鄄城县",
                    "定陶区",
                    "成武县",
                    "郓城县",
                    "巨野县",
                    "曹县",
                    "单县",
                    "牡丹区",
                    "东明县"
                ]
            },
            {
                "name"  : "青岛市",
                "adcode": "370200",
                "area"  : [
                    "莱西市",
                    "黄岛区",
                    "崂山区",
                    "即墨区",
                    "城阳区",
                    "市北区",
                    "市南区",
                    "李沧区",
                    "平度市",
                    "胶州市"
                ]
            }
        ]
    },
    {
        "name": "山西省",
        "city": [
            {
                "name"  : "临汾市",
                "adcode": "141000",
                "area"  : [
                    "古县",
                    "汾西县",
                    "隰县",
                    "大宁县",
                    "吉县",
                    "安泽县",
                    "永和县",
                    "霍州市",
                    "侯马市",
                    "乡宁县",
                    "蒲县",
                    "洪洞县",
                    "襄汾县",
                    "翼城县",
                    "浮山县",
                    "尧都区",
                    "曲沃县"
                ]
            },
            {
                "name"  : "吕梁市",
                "adcode": "141100",
                "area"  : [
                    "临县",
                    "离石区",
                    "方山县",
                    "岚县",
                    "中阳县",
                    "交口县",
                    "柳林县",
                    "兴县",
                    "石楼县",
                    "交城县",
                    "文水县",
                    "孝义市",
                    "汾阳市"
                ]
            },
            {
                "name"  : "大同市",
                "adcode": "140200",
                "area"  : [
                    "灵丘县",
                    "浑源县",
                    "广灵县",
                    "阳高县",
                    "新荣区",
                    "云州区",
                    "天镇县",
                    "左云县",
                    "平城区",
                    "云冈区"
                ]
            },
            {
                "name"  : "太原市",
                "adcode": "140100",
                "area"  : [
                    "娄烦县",
                    "尖草坪区",
                    "杏花岭区",
                    "阳曲县",
                    "清徐县",
                    "古交市",
                    "万柏林区",
                    "晋源区",
                    "小店区",
                    "迎泽区"
                ]
            },
            {
                "name"  : "忻州市",
                "adcode": "140900",
                "area"  : [
                    "原平市",
                    "宁武县",
                    "五台县",
                    "五寨县",
                    "偏关县",
                    "代县",
                    "岢岚县",
                    "忻府区",
                    "定襄县",
                    "静乐县",
                    "繁峙县",
                    "神池县",
                    "保德县",
                    "河曲县"
                ]
            },
            {
                "name"  : "晋中市",
                "adcode": "140700",
                "area"  : [
                    "和顺县",
                    "昔阳县",
                    "寿阳县",
                    "榆社县",
                    "介休市",
                    "左权县",
                    "灵石县",
                    "榆次区",
                    "太谷区",
                    "祁县",
                    "平遥县"
                ]
            },
            {
                "name"  : "晋城市",
                "adcode": "140500",
                "area"  : [
                    "城区",
                    "泽州县",
                    "沁水县",
                    "阳城县",
                    "陵川县",
                    "高平市"
                ]
            },
            {
                "name"  : "朔州市",
                "adcode": "140600",
                "area"  : [
                    "右玉县",
                    "平鲁区",
                    "山阴县",
                    "怀仁市",
                    "朔城区",
                    "应县"
                ]
            },
            {
                "name"  : "运城市",
                "adcode": "140800",
                "area"  : [
                    "夏县",
                    "盐湖区",
                    "万荣县",
                    "闻喜县",
                    "临猗县",
                    "平陆县",
                    "新绛县",
                    "垣曲县",
                    "稷山县",
                    "河津市",
                    "芮城县",
                    "永济市",
                    "绛县"
                ]
            },
            {
                "name"  : "长治市",
                "adcode": "140400",
                "area"  : [
                    "黎城县",
                    "屯留区",
                    "潞城区",
                    "长子县",
                    "平顺县",
                    "襄垣县",
                    "潞州区",
                    "沁县",
                    "武乡县",
                    "壶关县",
                    "沁源县",
                    "上党区"
                ]
            },
            {
                "name"  : "阳泉市",
                "adcode": "140300",
                "area"  : [
                    "平定县",
                    "郊区",
                    "城区",
                    "盂县",
                    "矿区"
                ]
            }
        ]
    },
    {
        "name": "广东省",
        "city": [
            {
                "name"  : "东莞市",
                "adcode": "441900",
                "area"  : [
                    "莞城街道",
                    "常平镇",
                    "大朗镇",
                    "麻涌镇",
                    "望牛墩镇",
                    "凤岗镇",
                    "东莞生态园",
                    "桥头镇",
                    "松山湖管委会",
                    "樟木头镇",
                    "石龙镇",
                    "塘厦镇",
                    "寮步镇",
                    "高埗镇",
                    "厚街镇",
                    "谢岗镇",
                    "虎门镇",
                    "虎门港管委会",
                    "南城街道",
                    "横沥镇",
                    "企石镇",
                    "东坑镇",
                    "东城街道",
                    "石排镇",
                    "洪梅镇",
                    "沙田镇",
                    "道滘镇",
                    "大岭山镇",
                    "清溪镇",
                    "茶山镇",
                    "石碣镇",
                    "中堂镇",
                    "万江街道",
                    "长安镇",
                    "黄江镇"
                ]
            },
            {
                "name"  : "中山市",
                "adcode": "442000",
                "area"  : [
                    "三角镇",
                    "横栏镇",
                    "五桂山街道",
                    "小榄镇",
                    "神湾镇",
                    "中山港街道",
                    "古镇镇",
                    "南朗街道",
                    "民众街道",
                    "港口镇",
                    "三乡镇",
                    "石岐街道",
                    "大涌镇",
                    "南头镇",
                    "黄圃镇",
                    "东区街道",
                    "阜沙镇",
                    "板芙镇",
                    "坦洲镇",
                    "西区街道",
                    "沙溪镇",
                    "南区街道",
                    "东凤镇"
                ]
            },
            {
                "name"  : "云浮市",
                "adcode": "445300",
                "area"  : [
                    "郁南县",
                    "罗定市",
                    "新兴县",
                    "云城区",
                    "云安区"
                ]
            },
            {
                "name"  : "佛山市",
                "adcode": "440600",
                "area"  : [
                    "三水区",
                    "高明区",
                    "顺德区",
                    "禅城区",
                    "南海区"
                ]
            },
            {
                "name"  : "广州市",
                "adcode": "440100",
                "area"  : [
                    "从化区",
                    "花都区",
                    "南沙区",
                    "海珠区",
                    "番禺区",
                    "增城区",
                    "黄埔区",
                    "天河区",
                    "白云区",
                    "越秀区",
                    "荔湾区"
                ]
            },
            {
                "name"  : "惠州市",
                "adcode": "441300",
                "area"  : [
                    "博罗县",
                    "龙门县",
                    "惠东县",
                    "惠阳区",
                    "惠城区"
                ]
            },
            {
                "name"  : "揭阳市",
                "adcode": "445200",
                "area"  : [
                    "普宁市",
                    "惠来县",
                    "榕城区",
                    "揭东区",
                    "揭西县"
                ]
            },
            {
                "name"  : "梅州市",
                "adcode": "441400",
                "area"  : [
                    "平远县",
                    "蕉岭县",
                    "兴宁市",
                    "丰顺县",
                    "梅县区",
                    "大埔县",
                    "梅江区",
                    "五华县"
                ]
            },
            {
                "name"  : "汕头市",
                "adcode": "440500",
                "area"  : [
                    "澄海区",
                    "濠江区",
                    "南澳县",
                    "龙湖区",
                    "金平区",
                    "潮南区",
                    "潮阳区"
                ]
            },
            {
                "name"  : "汕尾市",
                "adcode": "441500",
                "area"  : [
                    "陆河县",
                    "海丰县",
                    "陆丰市",
                    "城区"
                ]
            },
            {
                "name"  : "江门市",
                "adcode": "440700",
                "area"  : [
                    "鹤山市",
                    "台山市",
                    "江海区",
                    "开平市",
                    "恩平市",
                    "新会区",
                    "蓬江区"
                ]
            },
            {
                "name"  : "河源市",
                "adcode": "441600",
                "area"  : [
                    "和平县",
                    "连平县",
                    "龙川县",
                    "东源县",
                    "紫金县",
                    "源城区"
                ]
            },
            {
                "name"  : "深圳市",
                "adcode": "440300",
                "area"  : [
                    "宝安区",
                    "南山区",
                    "福田区",
                    "罗湖区",
                    "龙岗区",
                    "光明区",
                    "龙华区",
                    "坪山区",
                    "盐田区"
                ]
            },
            {
                "name"  : "清远市",
                "adcode": "441800",
                "area"  : [
                    "连南瑶族自治县",
                    "连州市",
                    "连山壮族瑶族自治县",
                    "英德市",
                    "佛冈县",
                    "阳山县",
                    "清城区",
                    "清新区"
                ]
            },
            {
                "name"  : "湛江市",
                "adcode": "440800",
                "area"  : [
                    "廉江市",
                    "雷州市",
                    "吴川市",
                    "麻章区",
                    "徐闻县",
                    "霞山区",
                    "坡头区",
                    "遂溪县",
                    "赤坎区"
                ]
            },
            {
                "name"  : "潮州市",
                "adcode": "445100",
                "area"  : [
                    "饶平县",
                    "湘桥区",
                    "潮安区"
                ]
            },
            {
                "name"  : "珠海市",
                "adcode": "440400",
                "area"  : [
                    "香洲区",
                    "斗门区",
                    "金湾区"
                ]
            },
            {
                "name"  : "肇庆市",
                "adcode": "441200",
                "area"  : [
                    "广宁县",
                    "怀集县",
                    "封开县",
                    "四会市",
                    "德庆县",
                    "端州区",
                    "鼎湖区",
                    "高要区"
                ]
            },
            {
                "name"  : "茂名市",
                "adcode": "440900",
                "area"  : [
                    "化州市",
                    "电白区",
                    "高州市",
                    "信宜市",
                    "茂南区"
                ]
            },
            {
                "name"  : "阳江市",
                "adcode": "441700",
                "area"  : [
                    "阳春市",
                    "江城区",
                    "阳西县",
                    "阳东区"
                ]
            },
            {
                "name"  : "韶关市",
                "adcode": "440200",
                "area"  : [
                    "仁化县",
                    "南雄市",
                    "浈江区",
                    "始兴县",
                    "乳源瑶族自治县",
                    "武江区",
                    "曲江区",
                    "翁源县",
                    "新丰县",
                    "乐昌市"
                ]
            }
        ]
    },
    {
        "name": "广西壮族自治区",
        "city": [
            {
                "name"  : "北海市",
                "adcode": "450500",
                "area"  : [
                    "铁山港区",
                    "银海区",
                    "海城区",
                    "合浦县"
                ]
            },
            {
                "name"  : "南宁市",
                "adcode": "450100",
                "area"  : [
                    "上林县",
                    "马山县",
                    "宾阳县",
                    "武鸣区",
                    "江南区",
                    "邕宁区",
                    "良庆区",
                    "青秀区",
                    "兴宁区",
                    "西乡塘区",
                    "隆安县",
                    "横州市"
                ]
            },
            {
                "name"  : "崇左市",
                "adcode": "451400",
                "area"  : [
                    "扶绥县",
                    "江州区",
                    "凭祥市",
                    "龙州县",
                    "大新县",
                    "宁明县",
                    "天等县"
                ]
            },
            {
                "name"  : "来宾市",
                "adcode": "451300",
                "area"  : [
                    "金秀瑶族自治县",
                    "合山市",
                    "忻城县",
                    "兴宾区",
                    "象州县",
                    "武宣县"
                ]
            },
            {
                "name"  : "柳州市",
                "adcode": "450200",
                "area"  : [
                    "三江侗族自治县",
                    "融水苗族自治县",
                    "融安县",
                    "鹿寨县",
                    "城中区",
                    "柳北区",
                    "柳城县",
                    "鱼峰区",
                    "柳南区",
                    "柳江区"
                ]
            },
            {
                "name"  : "桂林市",
                "adcode": "450300",
                "area"  : [
                    "雁山区",
                    "阳朔县",
                    "七星区",
                    "荔浦市",
                    "龙胜各族自治县",
                    "秀峰区",
                    "灌阳县",
                    "象山区",
                    "叠彩区",
                    "灵川县",
                    "资源县",
                    "平乐县",
                    "恭城瑶族自治县",
                    "兴安县",
                    "全州县",
                    "永福县",
                    "临桂区"
                ]
            },
            {
                "name"  : "梧州市",
                "adcode": "450400",
                "area"  : [
                    "蒙山县",
                    "岑溪市",
                    "长洲区",
                    "龙圩区",
                    "万秀区",
                    "苍梧县",
                    "藤县"
                ]
            },
            {
                "name"  : "河池市",
                "adcode": "451200",
                "area"  : [
                    "南丹县",
                    "环江毛南族自治县",
                    "天峨县",
                    "罗城仫佬族自治县",
                    "都安瑶族自治县",
                    "金城江区",
                    "凤山县",
                    "宜州区",
                    "大化瑶族自治县",
                    "东兰县",
                    "巴马瑶族自治县"
                ]
            },
            {
                "name"  : "玉林市",
                "adcode": "450900",
                "area"  : [
                    "福绵区",
                    "博白县",
                    "陆川县",
                    "北流市",
                    "容县",
                    "玉州区",
                    "兴业县"
                ]
            },
            {
                "name"  : "百色市",
                "adcode": "451000",
                "area"  : [
                    "乐业县",
                    "凌云县",
                    "隆林各族自治县",
                    "西林县",
                    "平果市",
                    "右江区",
                    "靖西市",
                    "那坡县",
                    "田林县",
                    "田东县",
                    "田阳区",
                    "德保县"
                ]
            },
            {
                "name"  : "贵港市",
                "adcode": "450800",
                "area"  : [
                    "港北区",
                    "港南区",
                    "平南县",
                    "桂平市",
                    "覃塘区"
                ]
            },
            {
                "name"  : "贺州市",
                "adcode": "451100",
                "area"  : [
                    "富川瑶族自治县",
                    "昭平县",
                    "钟山县",
                    "平桂区",
                    "八步区"
                ]
            },
            {
                "name"  : "钦州市",
                "adcode": "450700",
                "area"  : [
                    "钦南区",
                    "钦北区",
                    "灵山县",
                    "浦北县"
                ]
            },
            {
                "name"  : "防城港市",
                "adcode": "450600",
                "area"  : [
                    "港口区",
                    "防城区",
                    "东兴市",
                    "上思县"
                ]
            }
        ]
    },
    {
        "name": "新疆维吾尔自治区",
        "city": [
            {
                "name"  : "乌鲁木齐市",
                "adcode": "650100",
                "area"  : [
                    "达坂城区",
                    "天山区",
                    "米东区",
                    "水磨沟区",
                    "头屯河区",
                    "乌鲁木齐县",
                    "沙依巴克区",
                    "新市区"
                ]
            },
            {
                "name"  : "五家渠市",
                "adcode": "659004",
                "area"  : [
                    "梧桐镇",
                    "军垦路街道",
                    "人民路街道",
                    "兵团一零一团",
                    "蔡家湖镇",
                    "青湖路街道"
                ]
            },
            {
                "name"  : "伊犁哈萨克自治州",
                "adcode": "654000",
                "area"  : [
                    "奎屯市",
                    "巩留县",
                    "伊宁县",
                    "尼勒克县",
                    "新源县",
                    "察布查尔锡伯自治县",
                    "昭苏县",
                    "霍城县",
                    "特克斯县",
                    "霍尔果斯市",
                    "伊宁市"
                ]
            },
            {
                "name"  : "克孜勒苏柯尔克孜自治州",
                "adcode": "653000",
                "area"  : [
                    "乌恰县",
                    "阿图什市",
                    "阿合奇县",
                    "阿克陶县"
                ]
            },
            {
                "name"  : "克拉玛依市",
                "adcode": "650200",
                "area"  : [
                    "乌尔禾区",
                    "独山子区",
                    "克拉玛依区",
                    "白碱滩区"
                ]
            },
            {
                "name"  : "北屯市",
                "adcode": "659005",
                "area"  : [
                    "丰庆镇",
                    "海川镇",
                    "双渠镇",
                    "北屯镇"
                ]
            },
            {
                "name"  : "博尔塔拉蒙古自治州",
                "adcode": "652700",
                "area"  : [
                    "温泉县",
                    "阿拉山口市",
                    "精河县",
                    "博乐市"
                ]
            },
            {
                "name"  : "双河市",
                "adcode": "659007",
                "area"  : [
                    "兵团八十九团",
                    "博河镇",
                    "石峪镇",
                    "双乐镇",
                    "双桥镇"
                ]
            },
            {
                "name"  : "可克达拉市",
                "adcode": "659008",
                "area"  : [
                    "长丰镇",
                    "都拉塔口岸",
                    "兵团六十七团",
                    "兵团六十六团",
                    "榆树庄镇",
                    "苇湖镇"
                ]
            },
            {
                "name"  : "吐鲁番市",
                "adcode": "650400",
                "area"  : [
                    "高昌区",
                    "鄯善县",
                    "托克逊县"
                ]
            },
            {
                "name"  : "和田地区",
                "adcode": "653200",
                "area"  : [
                    "于田县",
                    "民丰县",
                    "和田市",
                    "和田县",
                    "墨玉县",
                    "洛浦县",
                    "皮山县",
                    "策勒县"
                ]
            },
            {
                "name"  : "哈密市",
                "adcode": "650500",
                "area"  : [
                    "伊吾县",
                    "巴里坤哈萨克自治县",
                    "伊州区"
                ]
            },
            {
                "name"  : "喀什地区",
                "adcode": "653100",
                "area"  : [
                    "伽师县",
                    "疏勒县",
                    "泽普县",
                    "叶城县",
                    "麦盖提县",
                    "塔什库尔干塔吉克自治县",
                    "莎车县",
                    "巴楚县",
                    "疏附县",
                    "英吉沙县",
                    "喀什市",
                    "岳普湖县"
                ]
            },
            {
                "name"  : "图木舒克市",
                "adcode": "659003",
                "area"  : [
                    "兵团四十九团",
                    "兵团图木舒克市永安坝",
                    "兵团五十一团",
                    "前海街道",
                    "兵团图木舒克市喀拉拜勒镇",
                    "永安坝街道",
                    "齐干却勒街道",
                    "兵团五十三团",
                    "夏河镇",
                    "兵团四十四团"
                ]
            },
            {
                "name"  : "塔城地区",
                "adcode": "654200",
                "area"  : [
                    "塔城市",
                    "额敏县",
                    "和布克赛尔蒙古自治县",
                    "裕民县",
                    "托里县",
                    "乌苏市",
                    "沙湾市"
                ]
            },
            {
                "name"  : "巴音郭楞蒙古自治州",
                "adcode": "652800",
                "area"  : [
                    "和静县",
                    "博湖县",
                    "和硕县",
                    "焉耆回族自治县",
                    "且末县",
                    "若羌县",
                    "轮台县",
                    "库尔勒市",
                    "尉犁县"
                ]
            },
            {
                "name"  : "昆玉市",
                "adcode": "659009",
                "area"  : [
                    "乌尔其乡",
                    "博斯坦乡",
                    "阔依其乡",
                    "兵团二二四团",
                    "昆牧镇",
                    "喀拉喀什镇",
                    "昆泉镇",
                    "普恰克其乡",
                    "奴尔乡",
                    "老兵镇",
                    "乌鲁克萨依乡"
                ]
            },
            {
                "name"  : "昌吉回族自治州",
                "adcode": "652300",
                "area"  : [
                    "玛纳斯县",
                    "奇台县",
                    "呼图壁县",
                    "木垒哈萨克自治县",
                    "阜康市",
                    "昌吉市",
                    "吉木萨尔县"
                ]
            },
            {
                "name"  : "石河子市",
                "adcode": "659001",
                "area"  : [
                    "兵团一五二团",
                    "向阳街道",
                    "红山街道",
                    "东城街道",
                    "石河子镇",
                    "老街街道",
                    "新城街道",
                    "北泉镇"
                ]
            },
            {
                "name"  : "胡杨河市",
                "adcode": "659010",
                "area"  : [
                    "兵团一三零团",
                    "五五新镇街道",
                    "兵团一二八团",
                    "兵团一二九团"
                ]
            },
            {
                "name"  : "铁门关市",
                "adcode": "659006",
                "area"  : [
                    "博古其镇",
                    "双丰镇"
                ]
            },
            {
                "name"  : "阿克苏地区",
                "adcode": "652900",
                "area"  : [
                    "新和县",
                    "温宿县",
                    "拜城县",
                    "沙雅县",
                    "库车市",
                    "阿克苏市",
                    "柯坪县",
                    "阿瓦提县",
                    "乌什县"
                ]
            },
            {
                "name"  : "阿勒泰地区",
                "adcode": "654300",
                "area"  : [
                    "布尔津县",
                    "富蕴县",
                    "哈巴河县",
                    "吉木乃县",
                    "青河县",
                    "阿勒泰市",
                    "福海县"
                ]
            },
            {
                "name"  : "阿拉尔市",
                "adcode": "659002",
                "area"  : [
                    "幸福路街道",
                    "阿拉尔农场",
                    "兵团第一师幸福农场",
                    "工业园区",
                    "兵团七团",
                    "花桥镇",
                    "兵团第一师水利水电工程处",
                    "青松路街道",
                    "托喀依乡",
                    "兵团八团",
                    "中心监狱",
                    "兵团第一师塔里木灌区水利管理处",
                    "金杨镇",
                    "南口街道",
                    "幸福镇",
                    "兵团十团",
                    "兵团十二团",
                    "金银川路街道",
                    "兵团十六团"
                ]
            }
        ]
    },
    {
        "name": "江苏省",
        "city": [
            {
                "name"  : "南京市",
                "adcode": "320100",
                "area"  : [
                    "雨花台区",
                    "浦口区",
                    "江宁区",
                    "六合区",
                    "高淳区",
                    "溧水区",
                    "建邺区",
                    "秦淮区",
                    "鼓楼区",
                    "玄武区",
                    "栖霞区"
                ]
            },
            {
                "name"  : "南通市",
                "adcode": "320600",
                "area"  : [
                    "海门区",
                    "启东市",
                    "如东县",
                    "海安市",
                    "崇川区",
                    "如皋市",
                    "通州区"
                ]
            },
            {
                "name"  : "宿迁市",
                "adcode": "321300",
                "area"  : [
                    "泗阳县",
                    "泗洪县",
                    "宿城区",
                    "宿豫区",
                    "沭阳县"
                ]
            },
            {
                "name"  : "常州市",
                "adcode": "320400",
                "area"  : [
                    "溧阳市",
                    "新北区",
                    "钟楼区",
                    "金坛区",
                    "天宁区",
                    "武进区"
                ]
            },
            {
                "name"  : "徐州市",
                "adcode": "320300",
                "area"  : [
                    "泉山区",
                    "铜山区",
                    "丰县",
                    "鼓楼区",
                    "新沂市",
                    "邳州市",
                    "睢宁县",
                    "贾汪区",
                    "云龙区",
                    "沛县"
                ]
            },
            {
                "name"  : "扬州市",
                "adcode": "321000",
                "area"  : [
                    "广陵区",
                    "宝应县",
                    "江都区",
                    "邗江区",
                    "高邮市",
                    "仪征市"
                ]
            },
            {
                "name"  : "无锡市",
                "adcode": "320200",
                "area"  : [
                    "新吴区",
                    "锡山区",
                    "宜兴市",
                    "惠山区",
                    "江阴市",
                    "梁溪区",
                    "滨湖区"
                ]
            },
            {
                "name"  : "泰州市",
                "adcode": "321200",
                "area"  : [
                    "海陵区",
                    "靖江市",
                    "高港区",
                    "泰兴市",
                    "姜堰区",
                    "兴化市"
                ]
            },
            {
                "name"  : "淮安市",
                "adcode": "320800",
                "area"  : [
                    "淮阴区",
                    "洪泽区",
                    "盱眙县",
                    "金湖县",
                    "涟水县",
                    "淮安区",
                    "清江浦区"
                ]
            },
            {
                "name"  : "盐城市",
                "adcode": "320900",
                "area"  : [
                    "建湖县",
                    "阜宁县",
                    "射阳县",
                    "滨海县",
                    "盐都区",
                    "东台市",
                    "响水县",
                    "大丰区",
                    "亭湖区"
                ]
            },
            {
                "name"  : "苏州市",
                "adcode": "320500",
                "area"  : [
                    "太仓市",
                    "吴江区",
                    "相城区",
                    "常熟市",
                    "昆山市",
                    "张家港市",
                    "吴中区",
                    "虎丘区",
                    "姑苏区"
                ]
            },
            {
                "name"  : "连云港市",
                "adcode": "320700",
                "area"  : [
                    "东海县",
                    "连云区",
                    "灌南县",
                    "赣榆区",
                    "海州区",
                    "灌云县"
                ]
            },
            {
                "name"  : "镇江市",
                "adcode": "321100",
                "area"  : [
                    "润州区",
                    "扬中市",
                    "京口区",
                    "丹徒区",
                    "丹阳市",
                    "句容市"
                ]
            }
        ]
    },
    {
        "name": "江西省",
        "city": [
            {
                "name"  : "上饶市",
                "adcode": "361100",
                "area"  : [
                    "弋阳县",
                    "婺源县",
                    "广丰区",
                    "横峰县",
                    "铅山县",
                    "玉山县",
                    "广信区",
                    "信州区",
                    "余干县",
                    "万年县",
                    "鄱阳县",
                    "德兴市"
                ]
            },
            {
                "name"  : "九江市",
                "adcode": "360400",
                "area"  : [
                    "都昌县",
                    "彭泽县",
                    "湖口县",
                    "武宁县",
                    "柴桑区",
                    "修水县",
                    "庐山市",
                    "濂溪区",
                    "永修县",
                    "共青城市",
                    "瑞昌市",
                    "德安县",
                    "浔阳区"
                ]
            },
            {
                "name"  : "南昌市",
                "adcode": "360100",
                "area"  : [
                    "进贤县",
                    "青云谱区",
                    "青山湖区",
                    "东湖区",
                    "安义县",
                    "红谷滩区",
                    "新建区",
                    "西湖区",
                    "南昌县"
                ]
            },
            {
                "name"  : "吉安市",
                "adcode": "360800",
                "area"  : [
                    "吉安县",
                    "吉州区",
                    "永丰县",
                    "永新县",
                    "吉水县",
                    "青原区",
                    "万安县",
                    "遂川县",
                    "安福县",
                    "新干县",
                    "峡江县",
                    "井冈山市",
                    "泰和县"
                ]
            },
            {
                "name"  : "宜春市",
                "adcode": "360900",
                "area"  : [
                    "上高县",
                    "丰城市",
                    "高安市",
                    "宜丰县",
                    "铜鼓县",
                    "万载县",
                    "袁州区",
                    "樟树市",
                    "靖安县",
                    "奉新县"
                ]
            },
            {
                "name"  : "抚州市",
                "adcode": "361000",
                "area"  : [
                    "东乡区",
                    "临川区",
                    "资溪县",
                    "宜黄县",
                    "南城县",
                    "崇仁县",
                    "金溪县",
                    "乐安县",
                    "黎川县",
                    "广昌县",
                    "南丰县"
                ]
            },
            {
                "name"  : "新余市",
                "adcode": "360500",
                "area"  : [
                    "分宜县",
                    "渝水区"
                ]
            },
            {
                "name"  : "景德镇市",
                "adcode": "360200",
                "area"  : [
                    "浮梁县",
                    "昌江区",
                    "乐平市",
                    "珠山区"
                ]
            },
            {
                "name"  : "萍乡市",
                "adcode": "360300",
                "area"  : [
                    "安源区",
                    "芦溪县",
                    "莲花县",
                    "上栗县",
                    "湘东区"
                ]
            },
            {
                "name"  : "赣州市",
                "adcode": "360700",
                "area"  : [
                    "宁都县",
                    "大余县",
                    "瑞金市",
                    "石城县",
                    "于都县",
                    "兴国县",
                    "寻乌县",
                    "崇义县",
                    "信丰县",
                    "上犹县",
                    "全南县",
                    "南康区",
                    "赣县区",
                    "龙南市",
                    "定南县",
                    "章贡区",
                    "安远县",
                    "会昌县"
                ]
            },
            {
                "name"  : "鹰潭市",
                "adcode": "360600",
                "area"  : [
                    "贵溪市",
                    "月湖区",
                    "余江区"
                ]
            }
        ]
    },
    {
        "name": "河北省",
        "city": [
            {
                "name"  : "保定市",
                "adcode": "130600",
                "area"  : [
                    "涞源县",
                    "易县",
                    "顺平县",
                    "徐水区",
                    "安新县",
                    "高阳县",
                    "竞秀区",
                    "安国市",
                    "定州市",
                    "莲池区",
                    "涞水县",
                    "涿州市",
                    "蠡县",
                    "博野县",
                    "望都县",
                    "阜平县",
                    "唐县",
                    "曲阳县",
                    "高碑店市",
                    "定兴县",
                    "容城县",
                    "雄县",
                    "满城区",
                    "清苑区"
                ]
            },
            {
                "name"  : "唐山市",
                "adcode": "130200",
                "area"  : [
                    "滦州市",
                    "遵化市",
                    "迁安市",
                    "迁西县",
                    "滦南县",
                    "曹妃甸区",
                    "乐亭县",
                    "玉田县",
                    "路南区",
                    "古冶区",
                    "开平区",
                    "丰南区",
                    "丰润区",
                    "路北区"
                ]
            },
            {
                "name"  : "廊坊市",
                "adcode": "131000",
                "area"  : [
                    "大厂回族自治县",
                    "大城县",
                    "永清县",
                    "固安县",
                    "香河县",
                    "文安县",
                    "三河市",
                    "广阳区",
                    "安次区",
                    "霸州市"
                ]
            },
            {
                "name"  : "张家口市",
                "adcode": "130700",
                "area"  : [
                    "沽源县",
                    "康保县",
                    "尚义县",
                    "下花园区",
                    "崇礼区",
                    "赤城县",
                    "张北县",
                    "万全区",
                    "怀来县",
                    "涿鹿县",
                    "桥西区",
                    "桥东区",
                    "宣化区",
                    "怀安县",
                    "蔚县",
                    "阳原县"
                ]
            },
            {
                "name"  : "承德市",
                "adcode": "130800",
                "area"  : [
                    "围场满族蒙古族自治县",
                    "丰宁满族自治县",
                    "隆化县",
                    "宽城满族自治县",
                    "鹰手营子矿区",
                    "兴隆县",
                    "平泉市",
                    "双滦区",
                    "滦平县",
                    "承德县",
                    "双桥区"
                ]
            },
            {
                "name"  : "沧州市",
                "adcode": "130900",
                "area"  : [
                    "任丘市",
                    "献县",
                    "运河区",
                    "南皮县",
                    "海兴县",
                    "东光县",
                    "吴桥县",
                    "黄骅市",
                    "青县",
                    "肃宁县",
                    "河间市",
                    "孟村回族自治县",
                    "盐山县",
                    "新华区",
                    "沧县",
                    "泊头市"
                ]
            },
            {
                "name"  : "石家庄市",
                "adcode": "130100",
                "area"  : [
                    "平山县",
                    "灵寿县",
                    "无极县",
                    "正定县",
                    "鹿泉区",
                    "晋州市",
                    "藁城区",
                    "元氏县",
                    "裕华区",
                    "赞皇县",
                    "高邑县",
                    "井陉县",
                    "新华区",
                    "新乐市",
                    "辛集市",
                    "井陉矿区",
                    "深泽县",
                    "栾城区",
                    "赵县",
                    "行唐县",
                    "长安区",
                    "桥西区"
                ]
            },
            {
                "name"  : "秦皇岛市",
                "adcode": "130300",
                "area"  : [
                    "青龙满族自治县",
                    "山海关区",
                    "卢龙县",
                    "北戴河区",
                    "抚宁区",
                    "海港区",
                    "昌黎县"
                ]
            },
            {
                "name"  : "衡水市",
                "adcode": "131100",
                "area"  : [
                    "桃城区",
                    "枣强县",
                    "深州市",
                    "饶阳县",
                    "安平县",
                    "阜城县",
                    "冀州区",
                    "故城县",
                    "景县",
                    "武邑县",
                    "武强县"
                ]
            },
            {
                "name"  : "邢台市",
                "adcode": "130500",
                "area"  : [
                    "南宫市",
                    "临城县",
                    "柏乡县",
                    "新河县",
                    "内丘县",
                    "清河县",
                    "平乡县",
                    "沙河市",
                    "广宗县",
                    "南和区",
                    "宁晋县",
                    "隆尧县",
                    "任泽区",
                    "巨鹿县",
                    "信都区",
                    "襄都区",
                    "威县",
                    "临西县"
                ]
            },
            {
                "name"  : "邯郸市",
                "adcode": "130400",
                "area"  : [
                    "肥乡区",
                    "涉县",
                    "魏县",
                    "临漳县",
                    "鸡泽县",
                    "曲周县",
                    "磁县",
                    "丛台区",
                    "永年区",
                    "复兴区",
                    "成安县",
                    "邯山区",
                    "馆陶县",
                    "邱县",
                    "大名县",
                    "广平县",
                    "峰峰矿区",
                    "武安市"
                ]
            }
        ]
    },
    {
        "name": "河南省",
        "city": [
            {
                "name"  : "三门峡市",
                "adcode": "411200",
                "area"  : [
                    "湖滨区",
                    "渑池县",
                    "卢氏县",
                    "义马市",
                    "陕州区",
                    "灵宝市"
                ]
            },
            {
                "name"  : "信阳市",
                "adcode": "411500",
                "area"  : [
                    "罗山县",
                    "淮滨县",
                    "浉河区",
                    "商城县",
                    "固始县",
                    "平桥区",
                    "潢川县",
                    "新县",
                    "息县",
                    "光山县"
                ]
            },
            {
                "name"  : "南阳市",
                "adcode": "411300",
                "area"  : [
                    "西峡县",
                    "卧龙区",
                    "唐河县",
                    "南召县",
                    "镇平县",
                    "淅川县",
                    "内乡县",
                    "宛城区",
                    "桐柏县",
                    "邓州市",
                    "方城县",
                    "社旗县",
                    "新野县"
                ]
            },
            {
                "name"  : "周口市",
                "adcode": "411600",
                "area"  : [
                    "项城市",
                    "商水县",
                    "川汇区",
                    "鹿邑县",
                    "郸城县",
                    "淮阳区",
                    "西华县",
                    "扶沟县",
                    "沈丘县",
                    "太康县"
                ]
            },
            {
                "name"  : "商丘市",
                "adcode": "411400",
                "area"  : [
                    "宁陵县",
                    "睢阳区",
                    "夏邑县",
                    "永城市",
                    "睢县",
                    "民权县",
                    "梁园区",
                    "柘城县",
                    "虞城县"
                ]
            },
            {
                "name"  : "安阳市",
                "adcode": "410500",
                "area"  : [
                    "殷都区",
                    "内黄县",
                    "安阳县",
                    "龙安区",
                    "北关区",
                    "林州市",
                    "汤阴县",
                    "滑县",
                    "文峰区"
                ]
            },
            {
                "name"  : "平顶山市",
                "adcode": "410400",
                "area"  : [
                    "湛河区",
                    "鲁山县",
                    "卫东区",
                    "舞钢市",
                    "叶县",
                    "新华区",
                    "石龙区",
                    "郏县",
                    "汝州市",
                    "宝丰县"
                ]
            },
            {
                "name"  : "开封市",
                "adcode": "410200",
                "area"  : [
                    "杞县",
                    "祥符区",
                    "尉氏县",
                    "禹王台区",
                    "通许县",
                    "兰考县",
                    "顺河回族区",
                    "鼓楼区",
                    "龙亭区"
                ]
            },
            {
                "name"  : "新乡市",
                "adcode": "410700",
                "area"  : [
                    "凤泉区",
                    "长垣市",
                    "牧野区",
                    "卫滨区",
                    "新乡县",
                    "获嘉县",
                    "封丘县",
                    "原阳县",
                    "红旗区",
                    "卫辉市",
                    "辉县市",
                    "延津县"
                ]
            },
            {
                "name"  : "洛阳市",
                "adcode": "410300",
                "area"  : [
                    "栾川县",
                    "新安县",
                    "洛宁县",
                    "偃师区",
                    "瀍河回族区",
                    "老城区",
                    "洛龙区",
                    "宜阳县",
                    "嵩县",
                    "西工区",
                    "涧西区",
                    "伊川县",
                    "汝阳县",
                    "孟津区"
                ]
            },
            {
                "name"  : "济源市",
                "adcode": "419001",
                "area"  : [
                    "济源市坡头镇",
                    "济源市梨林镇",
                    "济源市大峪镇",
                    "济源市思礼镇",
                    "济源市五龙口镇",
                    "济源市王屋镇",
                    "济源市玉泉街道",
                    "济源市轵城镇",
                    "济源市济水街道",
                    "济源市沁园街道",
                    "济源市下冶镇",
                    "济源市克井镇",
                    "济源市天坛街道",
                    "济源市邵原镇",
                    "济源市北海街道",
                    "济源市承留镇"
                ]
            },
            {
                "name"  : "漯河市",
                "adcode": "411100",
                "area"  : [
                    "临颍县",
                    "召陵区",
                    "源汇区",
                    "舞阳县",
                    "郾城区"
                ]
            },
            {
                "name"  : "濮阳市",
                "adcode": "410900",
                "area"  : [
                    "台前县",
                    "南乐县",
                    "范县",
                    "清丰县",
                    "华龙区",
                    "濮阳县"
                ]
            },
            {
                "name"  : "焦作市",
                "adcode": "410800",
                "area"  : [
                    "马村区",
                    "沁阳市",
                    "孟州市",
                    "博爱县",
                    "修武县",
                    "中站区",
                    "解放区",
                    "山阳区",
                    "武陟县",
                    "温县"
                ]
            },
            {
                "name"  : "许昌市",
                "adcode": "411000",
                "area"  : [
                    "建安区",
                    "魏都区",
                    "鄢陵县",
                    "襄城县",
                    "禹州市",
                    "长葛市"
                ]
            },
            {
                "name"  : "郑州市",
                "adcode": "410100",
                "area"  : [
                    "登封市",
                    "新密市",
                    "新郑市",
                    "上街区",
                    "中牟县",
                    "巩义市",
                    "惠济区",
                    "中原区",
                    "荥阳市",
                    "二七区",
                    "金水区",
                    "管城回族区"
                ]
            },
            {
                "name"  : "驻马店市",
                "adcode": "411700",
                "area"  : [
                    "上蔡县",
                    "西平县",
                    "新蔡县",
                    "泌阳县",
                    "遂平县",
                    "平舆县",
                    "驿城区",
                    "确山县",
                    "正阳县",
                    "汝南县"
                ]
            },
            {
                "name"  : "鹤壁市",
                "adcode": "410600",
                "area"  : [
                    "淇县",
                    "浚县",
                    "鹤山区",
                    "山城区",
                    "淇滨区"
                ]
            }
        ]
    },
    {
        "name": "浙江省",
        "city": [
            {
                "name"  : "丽水市",
                "adcode": "331100",
                "area"  : [
                    "松阳县",
                    "龙泉市",
                    "莲都区",
                    "云和县",
                    "景宁畲族自治县",
                    "遂昌县",
                    "青田县",
                    "庆元县",
                    "缙云县"
                ]
            },
            {
                "name"  : "台州市",
                "adcode": "331000",
                "area"  : [
                    "路桥区",
                    "椒江区",
                    "临海市",
                    "玉环市",
                    "温岭市",
                    "三门县",
                    "天台县",
                    "仙居县",
                    "黄岩区"
                ]
            },
            {
                "name"  : "嘉兴市",
                "adcode": "330400",
                "area"  : [
                    "平湖市",
                    "南湖区",
                    "嘉善县",
                    "海盐县",
                    "秀洲区",
                    "桐乡市",
                    "海宁市"
                ]
            },
            {
                "name"  : "宁波市",
                "adcode": "330200",
                "area"  : [
                    "北仑区",
                    "象山县",
                    "江北区",
                    "镇海区",
                    "宁海县",
                    "海曙区",
                    "鄞州区",
                    "奉化区",
                    "慈溪市",
                    "余姚市"
                ]
            },
            {
                "name"  : "杭州市",
                "adcode": "330100",
                "area"  : [
                    "富阳区",
                    "淳安县",
                    "上城区",
                    "桐庐县",
                    "建德市",
                    "滨江区",
                    "拱墅区",
                    "钱塘区",
                    "萧山区",
                    "西湖区",
                    "临安区",
                    "临平区",
                    "余杭区"
                ]
            },
            {
                "name"  : "温州市",
                "adcode": "330300",
                "area"  : [
                    "洞头区",
                    "苍南县",
                    "龙港市",
                    "平阳县",
                    "瑞安市",
                    "文成县",
                    "泰顺县",
                    "永嘉县",
                    "乐清市",
                    "龙湾区",
                    "鹿城区",
                    "瓯海区"
                ]
            },
            {
                "name"  : "湖州市",
                "adcode": "330500",
                "area"  : [
                    "长兴县",
                    "吴兴区",
                    "南浔区",
                    "安吉县",
                    "德清县"
                ]
            },
            {
                "name"  : "绍兴市",
                "adcode": "330600",
                "area"  : [
                    "嵊州市",
                    "新昌县",
                    "诸暨市",
                    "上虞区",
                    "越城区",
                    "柯桥区"
                ]
            },
            {
                "name"  : "舟山市",
                "adcode": "330900",
                "area"  : [
                    "普陀区",
                    "岱山县",
                    "嵊泗县",
                    "定海区"
                ]
            },
            {
                "name"  : "衢州市",
                "adcode": "330800",
                "area"  : [
                    "柯城区",
                    "江山市",
                    "龙游县",
                    "衢江区",
                    "常山县",
                    "开化县"
                ]
            },
            {
                "name"  : "金华市",
                "adcode": "330700",
                "area"  : [
                    "永康市",
                    "磐安县",
                    "武义县",
                    "东阳市",
                    "义乌市",
                    "金东区",
                    "婺城区",
                    "兰溪市",
                    "浦江县"
                ]
            }
        ]
    },
    {
        "name": "海南省",
        "city": [
            {
                "name"  : "万宁市",
                "adcode": "469006",
                "area"  : [
                    "后安镇",
                    "国营东和农场",
                    "万城镇",
                    "大茂镇",
                    "礼纪镇",
                    "山根镇",
                    "国营东兴农场",
                    "龙滚镇",
                    "兴隆华侨农场",
                    "和乐镇",
                    "三更罗镇",
                    "地方国营六连林场",
                    "国营新中农场",
                    "长丰镇",
                    "北大镇",
                    "南桥镇",
                    "东澳镇"
                ]
            },
            {
                "name"  : "三亚市",
                "adcode": "460200",
                "area"  : [
                    "海棠区",
                    "崖州区",
                    "吉阳区",
                    "天涯区"
                ]
            },
            {
                "name"  : "三沙市",
                "adcode": "460300",
                "area"  : [
                    "南沙区",
                    "西沙区"
                ]
            },
            {
                "name"  : "东方市",
                "adcode": "469007",
                "area"  : [
                    "东方华侨农场",
                    "天安乡",
                    "江边乡",
                    "东河镇",
                    "新龙镇",
                    "国营广坝农场",
                    "感城镇",
                    "三家镇",
                    "四更镇",
                    "板桥镇",
                    "八所镇",
                    "大田镇"
                ]
            },
            {
                "name"  : "临高县",
                "adcode": "469024",
                "area"  : [
                    "南宝镇",
                    "博厚镇",
                    "和舍镇",
                    "调楼镇",
                    "国营加来农场",
                    "东英镇",
                    "波莲镇",
                    "多文镇",
                    "新盈镇",
                    "临城镇",
                    "皇桐镇",
                    "国营红华农场"
                ]
            },
            {
                "name"  : "乐东黎族自治县",
                "adcode": "469027",
                "area"  : [
                    "莺歌海镇",
                    "国营山荣农场",
                    "国营保国农场",
                    "万冲镇",
                    "利国镇",
                    "大安镇",
                    "国营乐光农场",
                    "抱由镇",
                    "九所镇",
                    "国营尖峰岭林业公司",
                    "尖峰镇",
                    "佛罗镇",
                    "志仲镇",
                    "黄流镇",
                    "国营莺歌海盐场",
                    "千家镇"
                ]
            },
            {
                "name"  : "五指山市",
                "adcode": "469001",
                "area"  : [
                    "南圣镇",
                    "毛阳镇",
                    "水满乡",
                    "通什镇",
                    "番阳镇",
                    "毛道乡",
                    "畅好乡",
                    "国营畅好农场"
                ]
            },
            {
                "name"  : "保亭黎族苗族自治县",
                "adcode": "469029",
                "area"  : [
                    "加茂镇",
                    "海南保亭热带作物研究所",
                    "新政镇",
                    "国营金江农场",
                    "保城镇",
                    "南林乡",
                    "国营新星农场",
                    "国营三道农场",
                    "毛感乡",
                    "响水镇",
                    "什玲镇",
                    "六弓乡",
                    "三道镇"
                ]
            },
            {
                "name"  : "儋州市",
                "adcode": "460400",
                "area"  : [
                    "光村镇",
                    "洋浦经济开发区",
                    "兰洋镇",
                    "东成镇",
                    "和庆镇",
                    "王五镇",
                    "国营蓝洋农场",
                    "华南热作学院",
                    "排浦镇",
                    "新州镇",
                    "中和镇",
                    "海头镇",
                    "木棠镇",
                    "雅星镇",
                    "国营西联农场",
                    "南丰镇",
                    "国营西培农场",
                    "国营八一农场",
                    "白马井镇",
                    "那大镇",
                    "三都镇",
                    "大成镇",
                    "峨蔓镇"
                ]
            },
            {
                "name"  : "定安县",
                "adcode": "469021",
                "area"  : [
                    "富文镇",
                    "新竹镇",
                    "黄竹镇",
                    "国营中瑞农场",
                    "岭口镇",
                    "雷鸣镇",
                    "定城镇",
                    "国营南海农场",
                    "翰林镇",
                    "龙门镇",
                    "国营金鸡岭农场",
                    "龙河镇",
                    "龙湖镇"
                ]
            },
            {
                "name"  : "屯昌县",
                "adcode": "469022",
                "area"  : [
                    "国营中建农场",
                    "屯城镇",
                    "南吕镇",
                    "新兴镇",
                    "坡心镇",
                    "西昌镇",
                    "国营中坤农场",
                    "枫木镇",
                    "南坤镇",
                    "乌坡镇"
                ]
            },
            {
                "name"  : "文昌市",
                "adcode": "469005",
                "area"  : [
                    "会文镇",
                    "东阁镇",
                    "文教镇",
                    "国营罗豆农场",
                    "翁田镇",
                    "国营东路农场",
                    "龙楼镇",
                    "锦山镇",
                    "铺前镇",
                    "东郊镇",
                    "冯坡镇",
                    "国营南阳农场",
                    "昌洒镇",
                    "公坡镇",
                    "抱罗镇",
                    "潭牛镇",
                    "文城镇",
                    "东路镇",
                    "重兴镇",
                    "蓬莱镇"
                ]
            },
            {
                "name"  : "昌江黎族自治县",
                "adcode": "469026",
                "area"  : [
                    "国营霸王岭林场",
                    "十月田镇",
                    "乌烈镇",
                    "七叉镇",
                    "海南矿业联合有限公司",
                    "叉河镇",
                    "石碌镇",
                    "海尾镇",
                    "王下乡",
                    "国营红林农场",
                    "昌化镇"
                ]
            },
            {
                "name"  : "海口市",
                "adcode": "460100",
                "area"  : [
                    "龙华区",
                    "琼山区",
                    "美兰区",
                    "秀英区"
                ]
            },
            {
                "name"  : "澄迈县",
                "adcode": "469023",
                "area"  : [
                    "福山镇",
                    "永发镇",
                    "桥头镇",
                    "中兴镇",
                    "金江镇",
                    "老城镇",
                    "文儒镇",
                    "瑞溪镇",
                    "国营红岗农场",
                    "国营红光农场",
                    "大丰镇",
                    "加乐镇",
                    "国营昆仑农场",
                    "国营西达农场",
                    "仁兴镇",
                    "国营金安农场",
                    "国营和岭农场"
                ]
            },
            {
                "name"  : "琼中黎族苗族自治县",
                "adcode": "469030",
                "area"  : [
                    "吊罗山乡",
                    "湾岭镇",
                    "什运乡",
                    "和平镇",
                    "营根镇",
                    "国营乌石农场",
                    "国营阳江农场",
                    "国营加钗农场",
                    "上安乡",
                    "国营黎母山林业公司",
                    "中平镇",
                    "国营长征农场",
                    "黎母山镇",
                    "红毛镇",
                    "长征镇"
                ]
            },
            {
                "name"  : "琼海市",
                "adcode": "469002",
                "area"  : [
                    "会山镇",
                    "嘉积镇",
                    "国营东太农场",
                    "国营东升农场",
                    "万泉镇",
                    "大路镇",
                    "彬村山华侨农场",
                    "国营东红农场",
                    "潭门镇",
                    "龙江镇",
                    "塔洋镇",
                    "阳江镇",
                    "石壁镇",
                    "中原镇",
                    "博鳌镇",
                    "长坡镇"
                ]
            },
            {
                "name"  : "白沙黎族自治县",
                "adcode": "469025",
                "area"  : [
                    "七坊镇",
                    "金波乡",
                    "南开乡",
                    "荣邦乡",
                    "邦溪镇",
                    "细水乡",
                    "元门乡",
                    "打安镇",
                    "青松乡",
                    "国营龙江农场",
                    "国营白沙农场",
                    "牙叉镇",
                    "阜龙乡",
                    "国营邦溪农场"
                ]
            },
            {
                "name"  : "陵水黎族自治县",
                "adcode": "469028",
                "area"  : [
                    "椰林镇",
                    "新村镇",
                    "文罗镇",
                    "本号镇",
                    "国营南平农场",
                    "黎安镇",
                    "国营吊罗山林业公司",
                    "光坡镇",
                    "群英乡",
                    "提蒙乡",
                    "三才镇",
                    "隆广镇",
                    "国营岭门农场",
                    "英州镇"
                ]
            }
        ]
    },
    {
        "name": "湖北省",
        "city": [
            {
                "name"  : "仙桃市",
                "adcode": "429004",
                "area"  : [
                    "畜禽良种场",
                    "豆河镇",
                    "工业园区",
                    "沙湖镇",
                    "通海口镇",
                    "长倘口镇",
                    "胡场镇",
                    "五湖渔场",
                    "杨林尾镇",
                    "干河街道",
                    "赵西垸林场",
                    "西流河镇",
                    "彭场镇",
                    "九合垸原种场",
                    "沔城回族镇",
                    "龙华山街道",
                    "沙湖原种场",
                    "陈场镇",
                    "郑场镇",
                    "排湖风景区",
                    "沙嘴街道",
                    "郭河镇",
                    "毛嘴镇",
                    "张沟镇",
                    "三伏潭镇"
                ]
            },
            {
                "name"  : "十堰市",
                "adcode": "420300",
                "area"  : [
                    "茅箭区",
                    "郧阳区",
                    "丹江口市",
                    "张湾区",
                    "竹山县",
                    "房县",
                    "竹溪县",
                    "郧西县"
                ]
            },
            {
                "name"  : "咸宁市",
                "adcode": "421200",
                "area"  : [
                    "嘉鱼县",
                    "咸安区",
                    "通山县",
                    "赤壁市",
                    "崇阳县",
                    "通城县"
                ]
            },
            {
                "name"  : "天门市",
                "adcode": "429006",
                "area"  : [
                    "胡市镇",
                    "黄潭镇",
                    "多祥镇",
                    "沉湖管委会",
                    "干驿镇",
                    "马湾镇",
                    "横林镇",
                    "蒋湖农场",
                    "小板镇",
                    "岳口镇",
                    "多宝镇",
                    "蒋场镇",
                    "石家河镇",
                    "彭市镇",
                    "九真镇",
                    "佛子山镇",
                    "竟陵街道",
                    "候口街道",
                    "麻洋镇",
                    "杨林街道",
                    "汪场镇",
                    "皂市镇",
                    "白茅湖农场",
                    "张港镇",
                    "拖市镇",
                    "渔薪镇",
                    "净潭乡",
                    "卢市镇"
                ]
            },
            {
                "name"  : "孝感市",
                "adcode": "420900",
                "area"  : [
                    "云梦县",
                    "应城市",
                    "孝南区",
                    "汉川市",
                    "孝昌县",
                    "安陆市",
                    "大悟县"
                ]
            },
            {
                "name"  : "宜昌市",
                "adcode": "420500",
                "area"  : [
                    "兴山县",
                    "秭归县",
                    "当阳市",
                    "长阳土家族自治县",
                    "点军区",
                    "伍家岗区",
                    "宜都市",
                    "猇亭区",
                    "五峰土家族自治县",
                    "枝江市",
                    "西陵区",
                    "夷陵区",
                    "远安县"
                ]
            },
            {
                "name"  : "恩施土家族苗族自治州",
                "adcode": "422800",
                "area"  : [
                    "恩施市",
                    "建始县",
                    "利川市",
                    "鹤峰县",
                    "来凤县",
                    "巴东县",
                    "宣恩县",
                    "咸丰县"
                ]
            },
            {
                "name"  : "武汉市",
                "adcode": "420100",
                "area"  : [
                    "黄陂区",
                    "新洲区",
                    "汉南区",
                    "蔡甸区",
                    "江夏区",
                    "武昌区",
                    "硚口区",
                    "东西湖区",
                    "汉阳区",
                    "青山区",
                    "江汉区",
                    "江岸区",
                    "洪山区"
                ]
            },
            {
                "name"  : "潜江市",
                "adcode": "429005",
                "area"  : [
                    "积玉口镇",
                    "泰丰街道",
                    "广华街道",
                    "潜江经济开发区",
                    "周矶管理区",
                    "高场街道",
                    "周矶街道",
                    "总口管理区",
                    "运粮湖管理区",
                    "园林街道",
                    "白鹭湖管理区",
                    "王场镇",
                    "竹根滩镇",
                    "渔洋镇",
                    "熊口镇",
                    "江汉石油管理局",
                    "后湖管理区",
                    "熊口管理区",
                    "张金镇",
                    "杨市街道",
                    "浩口原种场",
                    "老新镇",
                    "龙湾镇",
                    "浩口镇",
                    "高石碑镇"
                ]
            },
            {
                "name"  : "神农架林区",
                "adcode": "429021",
                "area"  : [
                    "下谷坪土家族乡",
                    "木鱼镇",
                    "新华镇",
                    "大九湖镇",
                    "红坪镇",
                    "松柏镇",
                    "宋洛乡",
                    "阳日镇"
                ]
            },
            {
                "name"  : "荆州市",
                "adcode": "421000",
                "area"  : [
                    "石首市",
                    "洪湖市",
                    "江陵县",
                    "监利市",
                    "松滋市",
                    "沙市区",
                    "公安县",
                    "荆州区"
                ]
            },
            {
                "name"  : "荆门市",
                "adcode": "420800",
                "area"  : [
                    "钟祥市",
                    "东宝区",
                    "掇刀区",
                    "京山市",
                    "沙洋县"
                ]
            },
            {
                "name"  : "襄阳市",
                "adcode": "420600",
                "area"  : [
                    "谷城县",
                    "老河口市",
                    "宜城市",
                    "保康县",
                    "枣阳市",
                    "襄城区",
                    "樊城区",
                    "南漳县",
                    "襄州区"
                ]
            },
            {
                "name"  : "鄂州市",
                "adcode": "420700",
                "area"  : [
                    "华容区",
                    "梁子湖区",
                    "鄂城区"
                ]
            },
            {
                "name"  : "随州市",
                "adcode": "421300",
                "area"  : [
                    "曾都区",
                    "随县",
                    "广水市"
                ]
            },
            {
                "name"  : "黄冈市",
                "adcode": "421100",
                "area"  : [
                    "麻城市",
                    "蕲春县",
                    "黄州区",
                    "浠水县",
                    "红安县",
                    "英山县",
                    "武穴市",
                    "黄梅县",
                    "罗田县",
                    "团风县"
                ]
            },
            {
                "name"  : "黄石市",
                "adcode": "420200",
                "area"  : [
                    "西塞山区",
                    "下陆区",
                    "铁山区",
                    "大冶市",
                    "阳新县",
                    "黄石港区"
                ]
            }
        ]
    },
    {
        "name": "湖南省",
        "city": [
            {
                "name"  : "娄底市",
                "adcode": "431300",
                "area"  : [
                    "冷水江市",
                    "新化县",
                    "涟源市",
                    "双峰县",
                    "娄星区"
                ]
            },
            {
                "name"  : "岳阳市",
                "adcode": "430600",
                "area"  : [
                    "华容县",
                    "君山区",
                    "岳阳楼区",
                    "云溪区",
                    "汨罗市",
                    "湘阴县",
                    "岳阳县",
                    "平江县",
                    "临湘市"
                ]
            },
            {
                "name"  : "常德市",
                "adcode": "430700",
                "area"  : [
                    "澧县",
                    "鼎城区",
                    "津市市",
                    "武陵区",
                    "汉寿县",
                    "桃源县",
                    "安乡县",
                    "临澧县",
                    "石门县"
                ]
            },
            {
                "name"  : "张家界市",
                "adcode": "430800",
                "area"  : [
                    "慈利县",
                    "武陵源区",
                    "永定区",
                    "桑植县"
                ]
            },
            {
                "name"  : "怀化市",
                "adcode": "431200",
                "area"  : [
                    "芷江侗族自治县",
                    "洪江市",
                    "通道侗族自治县",
                    "沅陵县",
                    "辰溪县",
                    "溆浦县",
                    "会同县",
                    "靖州苗族侗族自治县",
                    "麻阳苗族自治县",
                    "新晃侗族自治县",
                    "中方县",
                    "鹤城区"
                ]
            },
            {
                "name"  : "株洲市",
                "adcode": "430200",
                "area"  : [
                    "荷塘区",
                    "攸县",
                    "茶陵县",
                    "炎陵县",
                    "天元区",
                    "芦淞区",
                    "渌口区",
                    "石峰区",
                    "醴陵市"
                ]
            },
            {
                "name"  : "永州市",
                "adcode": "431100",
                "area"  : [
                    "东安县",
                    "祁阳市",
                    "冷水滩区",
                    "新田县",
                    "零陵区",
                    "宁远县",
                    "双牌县",
                    "蓝山县",
                    "江永县",
                    "道县",
                    "江华瑶族自治县"
                ]
            },
            {
                "name"  : "湘潭市",
                "adcode": "430300",
                "area"  : [
                    "岳塘区",
                    "雨湖区",
                    "湘潭县",
                    "韶山市",
                    "湘乡市"
                ]
            },
            {
                "name"  : "湘西土家族苗族自治州",
                "adcode": "433100",
                "area"  : [
                    "永顺县",
                    "花垣县",
                    "吉首市",
                    "保靖县",
                    "古丈县",
                    "泸溪县",
                    "龙山县",
                    "凤凰县"
                ]
            },
            {
                "name"  : "益阳市",
                "adcode": "430900",
                "area"  : [
                    "资阳区",
                    "桃江县",
                    "赫山区",
                    "安化县",
                    "南县",
                    "沅江市"
                ]
            },
            {
                "name"  : "衡阳市",
                "adcode": "430400",
                "area"  : [
                    "衡东县",
                    "衡山县",
                    "衡阳县",
                    "南岳区",
                    "珠晖区",
                    "祁东县",
                    "石鼓区",
                    "雁峰区",
                    "衡南县",
                    "耒阳市",
                    "蒸湘区",
                    "常宁市"
                ]
            },
            {
                "name"  : "邵阳市",
                "adcode": "430500",
                "area"  : [
                    "隆回县",
                    "绥宁县",
                    "双清区",
                    "北塔区",
                    "邵阳县",
                    "大祥区",
                    "城步苗族自治县",
                    "新邵县",
                    "邵东市",
                    "新宁县",
                    "洞口县",
                    "武冈市"
                ]
            },
            {
                "name"  : "郴州市",
                "adcode": "431000",
                "area"  : [
                    "安仁县",
                    "永兴县",
                    "苏仙区",
                    "桂东县",
                    "汝城县",
                    "资兴市",
                    "北湖区",
                    "宜章县",
                    "桂阳县",
                    "临武县",
                    "嘉禾县"
                ]
            },
            {
                "name"  : "长沙市",
                "adcode": "430100",
                "area"  : [
                    "岳麓区",
                    "宁乡市",
                    "望城区",
                    "浏阳市",
                    "开福区",
                    "芙蓉区",
                    "长沙县",
                    "雨花区",
                    "天心区"
                ]
            }
        ]
    },
    {
        "name": "甘肃省",
        "city": [
            {
                "name"  : "临夏回族自治州",
                "adcode": "622900",
                "area"  : [
                    "临夏市",
                    "永靖县",
                    "积石山保安族东乡族撒拉族自治县",
                    "临夏县",
                    "东乡族自治县",
                    "和政县",
                    "广河县",
                    "康乐县"
                ]
            },
            {
                "name"  : "兰州市",
                "adcode": "620100",
                "area"  : [
                    "皋兰县",
                    "西固区",
                    "红古区",
                    "安宁区",
                    "城关区",
                    "七里河区",
                    "榆中县",
                    "永登县"
                ]
            },
            {
                "name"  : "嘉峪关市",
                "adcode": "620200",
                "area"  : [
                    "峪泉镇",
                    "新城镇",
                    "文殊镇",
                    "钢城街道",
                    "雄关街道"
                ]
            },
            {
                "name"  : "天水市",
                "adcode": "620500",
                "area"  : [
                    "秦安县",
                    "甘谷县",
                    "秦州区",
                    "麦积区",
                    "武山县",
                    "清水县",
                    "张家川回族自治县"
                ]
            },
            {
                "name"  : "定西市",
                "adcode": "621100",
                "area"  : [
                    "临洮县",
                    "渭源县",
                    "岷县",
                    "漳县",
                    "安定区",
                    "通渭县",
                    "陇西县"
                ]
            },
            {
                "name"  : "平凉市",
                "adcode": "620800",
                "area"  : [
                    "崆峒区",
                    "崇信县",
                    "庄浪县",
                    "灵台县",
                    "华亭市",
                    "静宁县",
                    "泾川县"
                ]
            },
            {
                "name"  : "庆阳市",
                "adcode": "621000",
                "area"  : [
                    "正宁县",
                    "环县",
                    "华池县",
                    "镇原县",
                    "宁县",
                    "庆城县",
                    "合水县",
                    "西峰区"
                ]
            },
            {
                "name"  : "张掖市",
                "adcode": "620700",
                "area"  : [
                    "高台县",
                    "肃南裕固族自治县",
                    "山丹县",
                    "民乐县",
                    "甘州区",
                    "临泽县"
                ]
            },
            {
                "name"  : "武威市",
                "adcode": "620600",
                "area"  : [
                    "古浪县",
                    "凉州区",
                    "民勤县",
                    "天祝藏族自治县"
                ]
            },
            {
                "name"  : "甘南藏族自治州",
                "adcode": "623000",
                "area"  : [
                    "合作市",
                    "夏河县",
                    "卓尼县",
                    "临潭县",
                    "玛曲县",
                    "舟曲县",
                    "迭部县",
                    "碌曲县"
                ]
            },
            {
                "name"  : "白银市",
                "adcode": "620400",
                "area"  : [
                    "平川区",
                    "靖远县",
                    "白银区",
                    "景泰县",
                    "会宁县"
                ]
            },
            {
                "name"  : "酒泉市",
                "adcode": "620900",
                "area"  : [
                    "肃北蒙古族自治县",
                    "玉门市",
                    "金塔县",
                    "敦煌市",
                    "肃州区",
                    "阿克塞哈萨克族自治县",
                    "瓜州县"
                ]
            },
            {
                "name"  : "金昌市",
                "adcode": "620300",
                "area"  : [
                    "金川区",
                    "永昌县"
                ]
            },
            {
                "name"  : "陇南市",
                "adcode": "621200",
                "area"  : [
                    "两当县",
                    "礼县",
                    "宕昌县",
                    "武都区",
                    "徽县",
                    "文县",
                    "西和县",
                    "成县",
                    "康县"
                ]
            }
        ]
    },
    {
        "name": "福建省",
        "city": [
            {
                "name"  : "三明市",
                "adcode": "350400",
                "area"  : [
                    "泰宁县",
                    "大田县",
                    "沙县区",
                    "尤溪县",
                    "建宁县",
                    "明溪县",
                    "将乐县",
                    "宁化县",
                    "三元区",
                    "清流县",
                    "永安市"
                ]
            },
            {
                "name"  : "南平市",
                "adcode": "350700",
                "area"  : [
                    "松溪县",
                    "邵武市",
                    "建阳区",
                    "浦城县",
                    "武夷山市",
                    "光泽县",
                    "政和县",
                    "建瓯市",
                    "延平区",
                    "顺昌县"
                ]
            },
            {
                "name"  : "厦门市",
                "adcode": "350200",
                "area"  : [
                    "湖里区",
                    "翔安区",
                    "思明区",
                    "海沧区",
                    "集美区",
                    "同安区"
                ]
            },
            {
                "name"  : "宁德市",
                "adcode": "350900",
                "area"  : [
                    "福安市",
                    "寿宁县",
                    "蕉城区",
                    "福鼎市",
                    "霞浦县",
                    "古田县",
                    "柘荣县",
                    "屏南县",
                    "周宁县"
                ]
            },
            {
                "name"  : "泉州市",
                "adcode": "350500",
                "area"  : [
                    "永春县",
                    "德化县",
                    "晋江市",
                    "洛江区",
                    "惠安县",
                    "南安市",
                    "石狮市",
                    "金门县",
                    "泉港区",
                    "安溪县",
                    "丰泽区",
                    "鲤城区"
                ]
            },
            {
                "name"  : "漳州市",
                "adcode": "350600",
                "area"  : [
                    "华安县",
                    "东山县",
                    "漳浦县",
                    "龙海区",
                    "芗城区",
                    "长泰区",
                    "诏安县",
                    "云霄县",
                    "南靖县",
                    "平和县",
                    "龙文区"
                ]
            },
            {
                "name"  : "福州市",
                "adcode": "350100",
                "area"  : [
                    "罗源县",
                    "连江县",
                    "闽清县",
                    "福清市",
                    "永泰县",
                    "长乐区",
                    "平潭县",
                    "台江区",
                    "马尾区",
                    "仓山区",
                    "闽侯县",
                    "鼓楼区",
                    "晋安区"
                ]
            },
            {
                "name"  : "莆田市",
                "adcode": "350300",
                "area"  : [
                    "秀屿区",
                    "荔城区",
                    "涵江区",
                    "仙游县",
                    "城厢区"
                ]
            },
            {
                "name"  : "龙岩市",
                "adcode": "350800",
                "area"  : [
                    "上杭县",
                    "武平县",
                    "漳平市",
                    "新罗区",
                    "长汀县",
                    "永定区",
                    "连城县"
                ]
            }
        ]
    },
    {
        "name": "西藏自治区",
        "city": [
            {
                "name"  : "山南市",
                "adcode": "540500",
                "area"  : [
                    "桑日县",
                    "加查县",
                    "乃东区",
                    "贡嘎县",
                    "扎囊县",
                    "浪卡子县",
                    "琼结县",
                    "曲松县",
                    "措美县",
                    "隆子县",
                    "洛扎县",
                    "错那县"
                ]
            },
            {
                "name"  : "拉萨市",
                "adcode": "540100",
                "area"  : [
                    "当雄县",
                    "墨竹工卡县",
                    "林周县",
                    "堆龙德庆区",
                    "尼木县",
                    "达孜区",
                    "城关区",
                    "曲水县"
                ]
            },
            {
                "name"  : "日喀则市",
                "adcode": "540200",
                "area"  : [
                    "仲巴县",
                    "昂仁县",
                    "南木林县",
                    "谢通门县",
                    "桑珠孜区",
                    "拉孜县",
                    "萨嘎县",
                    "吉隆县",
                    "仁布县",
                    "萨迦县",
                    "白朗县",
                    "定日县",
                    "康马县",
                    "聂拉木县",
                    "江孜县",
                    "岗巴县",
                    "定结县",
                    "亚东县"
                ]
            },
            {
                "name"  : "昌都市",
                "adcode": "540300",
                "area"  : [
                    "江达县",
                    "丁青县",
                    "卡若区",
                    "类乌齐县",
                    "洛隆县",
                    "贡觉县",
                    "边坝县",
                    "八宿县",
                    "察雅县",
                    "芒康县",
                    "左贡县"
                ]
            },
            {
                "name"  : "林芝市",
                "adcode": "540400",
                "area"  : [
                    "波密县",
                    "工布江达县",
                    "巴宜区",
                    "墨脱县",
                    "米林县",
                    "朗县",
                    "察隅县"
                ]
            },
            {
                "name"  : "那曲市",
                "adcode": "540600",
                "area"  : [
                    "巴青县",
                    "安多县",
                    "聂荣县",
                    "申扎县",
                    "比如县",
                    "班戈县",
                    "色尼区",
                    "索县",
                    "嘉黎县",
                    "尼玛县",
                    "双湖县"
                ]
            },
            {
                "name"  : "阿里地区",
                "adcode": "542500",
                "area"  : [
                    "札达县",
                    "改则县",
                    "措勤县",
                    "普兰县",
                    "噶尔县",
                    "革吉县",
                    "日土县"
                ]
            }
        ]
    },
    {
        "name": "贵州省",
        "city": [
            {
                "name"  : "六盘水市",
                "adcode": "520200",
                "area"  : [
                    "钟山区",
                    "六枝特区",
                    "盘州市",
                    "水城区"
                ]
            },
            {
                "name"  : "安顺市",
                "adcode": "520400",
                "area"  : [
                    "西秀区",
                    "紫云苗族布依族自治县",
                    "关岭布依族苗族自治县",
                    "镇宁布依族苗族自治县",
                    "平坝区",
                    "普定县"
                ]
            },
            {
                "name"  : "毕节市",
                "adcode": "520500",
                "area"  : [
                    "七星关区",
                    "黔西市",
                    "金沙县",
                    "织金县",
                    "威宁彝族回族苗族自治县",
                    "赫章县",
                    "大方县",
                    "纳雍县"
                ]
            },
            {
                "name"  : "贵阳市",
                "adcode": "520100",
                "area"  : [
                    "开阳县",
                    "白云区",
                    "修文县",
                    "息烽县",
                    "清镇市",
                    "南明区",
                    "花溪区",
                    "观山湖区",
                    "乌当区",
                    "云岩区"
                ]
            },
            {
                "name"  : "遵义市",
                "adcode": "520300",
                "area"  : [
                    "桐梓县",
                    "绥阳县",
                    "余庆县",
                    "湄潭县",
                    "仁怀市",
                    "播州区",
                    "赤水市",
                    "习水县",
                    "道真仡佬族苗族自治县",
                    "正安县",
                    "务川仡佬族苗族自治县",
                    "凤冈县",
                    "汇川区",
                    "红花岗区"
                ]
            },
            {
                "name"  : "铜仁市",
                "adcode": "520600",
                "area"  : [
                    "印江土家族苗族自治县",
                    "石阡县",
                    "碧江区",
                    "德江县",
                    "万山区",
                    "玉屏侗族自治县",
                    "思南县",
                    "松桃苗族自治县",
                    "江口县",
                    "沿河土家族自治县"
                ]
            },
            {
                "name"  : "黔东南苗族侗族自治州",
                "adcode": "522600",
                "area"  : [
                    "榕江县",
                    "雷山县",
                    "天柱县",
                    "施秉县",
                    "镇远县",
                    "凯里市",
                    "丹寨县",
                    "黎平县",
                    "从江县",
                    "锦屏县",
                    "台江县",
                    "黄平县",
                    "岑巩县",
                    "麻江县",
                    "三穗县",
                    "剑河县"
                ]
            },
            {
                "name"  : "黔南布依族苗族自治州",
                "adcode": "522700",
                "area"  : [
                    "惠水县",
                    "长顺县",
                    "平塘县",
                    "荔波县",
                    "独山县",
                    "罗甸县",
                    "贵定县",
                    "龙里县",
                    "福泉市",
                    "瓮安县",
                    "三都水族自治县",
                    "都匀市"
                ]
            },
            {
                "name"  : "黔西南布依族苗族自治州",
                "adcode": "522300",
                "area"  : [
                    "兴义市",
                    "兴仁市",
                    "册亨县",
                    "安龙县",
                    "晴隆县",
                    "贞丰县",
                    "望谟县",
                    "普安县"
                ]
            }
        ]
    },
    {
        "name": "辽宁省",
        "city": [
            {
                "name"  : "丹东市",
                "adcode": "210600",
                "area"  : [
                    "凤城市",
                    "振安区",
                    "东港市",
                    "振兴区",
                    "宽甸满族自治县",
                    "元宝区"
                ]
            },
            {
                "name"  : "大连市",
                "adcode": "210200",
                "area"  : [
                    "瓦房店市",
                    "庄河市",
                    "普兰店区",
                    "金州区",
                    "旅顺口区",
                    "长海县",
                    "中山区",
                    "甘井子区",
                    "沙河口区",
                    "西岗区"
                ]
            },
            {
                "name"  : "抚顺市",
                "adcode": "210400",
                "area"  : [
                    "新宾满族自治县",
                    "清原满族自治县",
                    "新抚区",
                    "顺城区",
                    "望花区",
                    "东洲区",
                    "抚顺县"
                ]
            },
            {
                "name"  : "朝阳市",
                "adcode": "211300",
                "area"  : [
                    "朝阳县",
                    "北票市",
                    "双塔区",
                    "龙城区",
                    "建平县",
                    "喀喇沁左翼蒙古族自治县",
                    "凌源市"
                ]
            },
            {
                "name"  : "本溪市",
                "adcode": "210500",
                "area"  : [
                    "桓仁满族自治县",
                    "溪湖区",
                    "南芬区",
                    "明山区",
                    "平山区",
                    "本溪满族自治县"
                ]
            },
            {
                "name"  : "沈阳市",
                "adcode": "210100",
                "area"  : [
                    "新民市",
                    "皇姑区",
                    "于洪区",
                    "苏家屯区",
                    "和平区",
                    "康平县",
                    "法库县",
                    "沈河区",
                    "大东区",
                    "铁西区",
                    "辽中区",
                    "浑南区",
                    "沈北新区"
                ]
            },
            {
                "name"  : "盘锦市",
                "adcode": "211100",
                "area"  : [
                    "大洼区",
                    "盘山县",
                    "兴隆台区",
                    "双台子区"
                ]
            },
            {
                "name"  : "营口市",
                "adcode": "210800",
                "area"  : [
                    "西市区",
                    "大石桥市",
                    "盖州市",
                    "鲅鱼圈区",
                    "站前区",
                    "老边区"
                ]
            },
            {
                "name"  : "葫芦岛市",
                "adcode": "211400",
                "area"  : [
                    "建昌县",
                    "兴城市",
                    "龙港区",
                    "绥中县",
                    "连山区",
                    "南票区"
                ]
            },
            {
                "name"  : "辽阳市",
                "adcode": "211000",
                "area"  : [
                    "白塔区",
                    "辽阳县",
                    "太子河区",
                    "文圣区",
                    "灯塔市",
                    "宏伟区",
                    "弓长岭区"
                ]
            },
            {
                "name"  : "铁岭市",
                "adcode": "211200",
                "area"  : [
                    "开原市",
                    "调兵山市",
                    "清河区",
                    "西丰县",
                    "铁岭县",
                    "银州区",
                    "昌图县"
                ]
            },
            {
                "name"  : "锦州市",
                "adcode": "210700",
                "area"  : [
                    "黑山县",
                    "义县",
                    "凌海市",
                    "太和区",
                    "北镇市",
                    "古塔区",
                    "凌河区"
                ]
            },
            {
                "name"  : "阜新市",
                "adcode": "210900",
                "area"  : [
                    "清河门区",
                    "太平区",
                    "新邱区",
                    "阜新蒙古族自治县",
                    "彰武县",
                    "海州区",
                    "细河区"
                ]
            },
            {
                "name"  : "鞍山市",
                "adcode": "210300",
                "area"  : [
                    "台安县",
                    "岫岩满族自治县",
                    "千山区",
                    "铁东区",
                    "铁西区",
                    "立山区",
                    "海城市"
                ]
            }
        ]
    },
    {
        "name": "重庆市",
        "city": [
            {
                "name"  : "重庆市",
                "adcode": "500100",
                "area"  : [
                    "璧山区",
                    "潼南区",
                    "铜梁区",
                    "合川区",
                    "长寿区",
                    "大足区",
                    "永川区",
                    "大渡口区",
                    "涪陵区",
                    "荣昌区",
                    "九龙坡区",
                    "万州区",
                    "渝中区",
                    "南川区",
                    "綦江区",
                    "开州区",
                    "梁平区",
                    "江津区",
                    "黔江区",
                    "南岸区",
                    "巴南区",
                    "北碚区",
                    "武隆区",
                    "沙坪坝区",
                    "江北区",
                    "渝北区"
                ]
            },
            {
                "name"  : "重庆郊县",
                "adcode": "500200",
                "area"  : [
                    "城口县",
                    "巫溪县",
                    "彭水苗族土家族自治县",
                    "奉节县",
                    "秀山土家族苗族自治县",
                    "云阳县",
                    "垫江县",
                    "石柱土家族自治县",
                    "忠县",
                    "丰都县",
                    "酉阳土家族苗族自治县",
                    "巫山县"
                ]
            }
        ]
    },
    {
        "name": "陕西省",
        "city": [
            {
                "name"  : "咸阳市",
                "adcode": "610400",
                "area"  : [
                    "永寿县",
                    "乾县",
                    "渭城区",
                    "泾阳县",
                    "长武县",
                    "三原县",
                    "淳化县",
                    "秦都区",
                    "礼泉县",
                    "杨陵区",
                    "兴平市",
                    "武功县",
                    "彬州市",
                    "旬邑县"
                ]
            },
            {
                "name"  : "商洛市",
                "adcode": "611000",
                "area"  : [
                    "丹凤县",
                    "镇安县",
                    "商南县",
                    "洛南县",
                    "山阳县",
                    "商州区",
                    "柞水县"
                ]
            },
            {
                "name"  : "安康市",
                "adcode": "610900",
                "area"  : [
                    "宁陕县",
                    "石泉县",
                    "汉阴县",
                    "岚皋县",
                    "平利县",
                    "紫阳县",
                    "镇坪县",
                    "旬阳市",
                    "白河县",
                    "汉滨区"
                ]
            },
            {
                "name"  : "宝鸡市",
                "adcode": "610300",
                "area"  : [
                    "麟游县",
                    "陇县",
                    "金台区",
                    "凤县",
                    "千阳县",
                    "渭滨区",
                    "岐山县",
                    "陈仓区",
                    "凤翔区",
                    "太白县",
                    "眉县",
                    "扶风县"
                ]
            },
            {
                "name"  : "延安市",
                "adcode": "610600",
                "area"  : [
                    "子长市",
                    "宝塔区",
                    "甘泉县",
                    "安塞区",
                    "宜川县",
                    "志丹县",
                    "洛川县",
                    "吴起县",
                    "延川县",
                    "延长县",
                    "富县",
                    "黄陵县",
                    "黄龙县"
                ]
            },
            {
                "name"  : "榆林市",
                "adcode": "610800",
                "area"  : [
                    "府谷县",
                    "榆阳区",
                    "吴堡县",
                    "佳县",
                    "绥德县",
                    "横山区",
                    "米脂县",
                    "神木市",
                    "清涧县",
                    "靖边县",
                    "子洲县",
                    "定边县"
                ]
            },
            {
                "name"  : "汉中市",
                "adcode": "610700",
                "area"  : [
                    "佛坪县",
                    "西乡县",
                    "略阳县",
                    "留坝县",
                    "洋县",
                    "宁强县",
                    "勉县",
                    "南郑区",
                    "城固县",
                    "汉台区",
                    "镇巴县"
                ]
            },
            {
                "name"  : "渭南市",
                "adcode": "610500",
                "area"  : [
                    "韩城市",
                    "白水县",
                    "潼关县",
                    "澄城县",
                    "蒲城县",
                    "合阳县",
                    "富平县",
                    "华阴市",
                    "华州区",
                    "大荔县",
                    "临渭区"
                ]
            },
            {
                "name"  : "西安市",
                "adcode": "610100",
                "area"  : [
                    "临潼区",
                    "鄠邑区",
                    "高陵区",
                    "莲湖区",
                    "灞桥区",
                    "阎良区",
                    "未央区",
                    "长安区",
                    "周至县",
                    "蓝田县",
                    "雁塔区",
                    "碑林区",
                    "新城区"
                ]
            },
            {
                "name"  : "铜川市",
                "adcode": "610200",
                "area"  : [
                    "耀州区",
                    "宜君县",
                    "印台区",
                    "王益区"
                ]
            }
        ]
    },
    {
        "name": "青海省",
        "city": [
            {
                "name"  : "果洛藏族自治州",
                "adcode": "632600",
                "area"  : [
                    "玛沁县",
                    "甘德县",
                    "班玛县",
                    "达日县",
                    "久治县",
                    "玛多县"
                ]
            },
            {
                "name"  : "海东市",
                "adcode": "630200",
                "area"  : [
                    "乐都区",
                    "民和回族土族自治县",
                    "化隆回族自治县",
                    "循化撒拉族自治县",
                    "平安区",
                    "互助土族自治县"
                ]
            },
            {
                "name"  : "海北藏族自治州",
                "adcode": "632200",
                "area"  : [
                    "海晏县",
                    "刚察县",
                    "门源回族自治县",
                    "祁连县"
                ]
            },
            {
                "name"  : "海南藏族自治州",
                "adcode": "632500",
                "area"  : [
                    "共和县",
                    "贵德县",
                    "同德县",
                    "贵南县",
                    "兴海县"
                ]
            },
            {
                "name"  : "海西蒙古族藏族自治州",
                "adcode": "632800",
                "area"  : [
                    "天峻县",
                    "都兰县",
                    "格尔木市",
                    "德令哈市",
                    "乌兰县",
                    "海西蒙古族藏族自治州直辖",
                    "茫崖市"
                ]
            },
            {
                "name"  : "玉树藏族自治州",
                "adcode": "632700",
                "area"  : [
                    "治多县",
                    "曲麻莱县",
                    "称多县",
                    "杂多县",
                    "玉树市",
                    "囊谦县"
                ]
            },
            {
                "name"  : "西宁市",
                "adcode": "630100",
                "area"  : [
                    "湟源县",
                    "大通回族土族自治县",
                    "城东区",
                    "城中区",
                    "城西区",
                    "城北区",
                    "湟中区"
                ]
            },
            {
                "name"  : "黄南藏族自治州",
                "adcode": "632300",
                "area"  : [
                    "尖扎县",
                    "同仁市",
                    "泽库县",
                    "河南蒙古族自治县"
                ]
            }
        ]
    },
    {
        "name": "黑龙江省",
        "city": [
            {
                "name"  : "七台河市",
                "adcode": "230900",
                "area"  : [
                    "桃山区",
                    "茄子河区",
                    "勃利县",
                    "新兴区"
                ]
            },
            {
                "name"  : "伊春市",
                "adcode": "230700",
                "area"  : [
                    "嘉荫县",
                    "友好区",
                    "伊美区",
                    "乌翠区",
                    "汤旺县",
                    "丰林县",
                    "金林区",
                    "铁力市",
                    "南岔县",
                    "大箐山县"
                ]
            },
            {
                "name"  : "佳木斯市",
                "adcode": "230800",
                "area"  : [
                    "同江市",
                    "桦川县",
                    "汤原县",
                    "郊区",
                    "东风区",
                    "前进区",
                    "向阳区",
                    "桦南县",
                    "抚远市",
                    "富锦市"
                ]
            },
            {
                "name"  : "双鸭山市",
                "adcode": "230500",
                "area"  : [
                    "尖山区",
                    "友谊县",
                    "宝山区",
                    "岭东区",
                    "宝清县",
                    "饶河县",
                    "集贤县",
                    "四方台区"
                ]
            },
            {
                "name"  : "哈尔滨市",
                "adcode": "230100",
                "area"  : [
                    "巴彦县",
                    "依兰县",
                    "宾县",
                    "木兰县",
                    "通河县",
                    "方正县",
                    "双城区",
                    "平房区",
                    "延寿县",
                    "尚志市",
                    "香坊区",
                    "道里区",
                    "五常市",
                    "阿城区",
                    "呼兰区",
                    "松北区",
                    "道外区",
                    "南岗区"
                ]
            },
            {
                "name"  : "大兴安岭地区",
                "adcode": "232700",
                "area"  : [
                    "漠河市",
                    "呼玛县",
                    "塔河县",
                    "加格达奇区"
                ]
            },
            {
                "name"  : "大庆市",
                "adcode": "230600",
                "area"  : [
                    "让胡路区",
                    "红岗区",
                    "肇源县",
                    "大同区",
                    "林甸县",
                    "杜尔伯特蒙古族自治县",
                    "萨尔图区",
                    "龙凤区",
                    "肇州县"
                ]
            },
            {
                "name"  : "牡丹江市",
                "adcode": "231000",
                "area"  : [
                    "爱民区",
                    "绥芬河市",
                    "东安区",
                    "宁安市",
                    "林口县",
                    "穆棱市",
                    "阳明区",
                    "西安区",
                    "海林市",
                    "东宁市"
                ]
            },
            {
                "name"  : "绥化市",
                "adcode": "231200",
                "area"  : [
                    "绥棱县",
                    "海伦市",
                    "庆安县",
                    "望奎县",
                    "青冈县",
                    "北林区",
                    "兰西县",
                    "明水县",
                    "肇东市",
                    "安达市"
                ]
            },
            {
                "name"  : "鸡西市",
                "adcode": "230300",
                "area"  : [
                    "麻山区",
                    "城子河区",
                    "鸡冠区",
                    "梨树区",
                    "滴道区",
                    "恒山区",
                    "密山市",
                    "鸡东县",
                    "虎林市"
                ]
            },
            {
                "name"  : "鹤岗市",
                "adcode": "230400",
                "area"  : [
                    "绥滨县",
                    "工农区",
                    "向阳区",
                    "兴山区",
                    "南山区",
                    "萝北县",
                    "东山区",
                    "兴安区"
                ]
            },
            {
                "name"  : "黑河市",
                "adcode": "231100",
                "area"  : [
                    "爱辉区",
                    "北安市",
                    "逊克县",
                    "五大连池市",
                    "孙吴县",
                    "嫩江市"
                ]
            },
            {
                "name"  : "齐齐哈尔市",
                "adcode": "230200",
                "area"  : [
                    "甘南县",
                    "富裕县",
                    "克山县",
                    "克东县",
                    "依安县",
                    "梅里斯达斡尔族区",
                    "铁锋区",
                    "龙江县",
                    "富拉尔基区",
                    "碾子山区",
                    "龙沙区",
                    "建华区",
                    "昂昂溪区",
                    "泰来县",
                    "拜泉县",
                    "讷河市"
                ]
            }
        ]
    }
]
